[["http://contemporary-home-computing.org/", "Contemporary Home Computing", ["text", "\tContemporary Home Computing\tContemporary Home Computing\tBlogs\nOne Terabyte of Kilobyte Age\nA blog about digging through the Geocities Torrent\tOlia & Dragan, 2011-01-18\tCar Metaphors\nwatches metaphors from RL (real life) that are wrongly applied to computers.\tMaintained by Olia Lialina\tIdioms\nsuggests backward idioms that come from computers into RL (real life).\tMaintained by Dragan Espenschied\tArticles\nOnce Again, The Doorknob\nOn Affordance, Forgiveness and Ambiguity in Human Computer and Human Robot Interaction.\tOlia Lialina, 2018-06-08\nNot Art&Tech\nOn the role of Media Theory at Universities of Applied Art, Technology and Art and Technology.\tOlia Lialina, 2015-11-17\nRich User Experience, UX and Desktopization of War\nThe morning after experience design\tOlia Lialina, 2015-01-03\nTuring Complete User\nWhat does it mean to be a user?\tOlia Lialina, 2012-10-14\nStill There\nUsers, Web P"], 2342], ["http://contemporary-home-computing.org/car-metaphors/", "Car Metaphors  ", ["text", "\tCar Metaphors\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tJunkie, as a Killer Anti “User” Argument\n2013-05-27 22:34\tby olia\tIn 2006, the “restless entrepreneur” Derek Powazek posted an all in all reasonable text on his blog, “Death to User-Generated Content”, in which he suggested to get rid of\tthe expression “user generated content” which was very actual back then and is still in use today. Good intention, this term is ugly and hypocritical. What reads strange though is the argumentation: The word user was announced to be bad, because user = junkie.\nI was reminded about it when I saw a tweet quoting the “galileo of graphics”, Edward Tufte:\tIt is very easy to attack the word “user” on this level. But what for? To call them customers and make them see themselves as customers?\nWhy are reputable thinkers not using their eloquence to distinguish computer users from drug users, customers, buyers and people?\nRead more on attack"], 11231], ["http://contemporary-home-computing.org/idioms/", "Idioms  ", ["text", "\tIdioms\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\t“I need to underclock.” — Time for holidays!\n2007-03-20 23:01\tby drx\tMost “knowledge workers” of “our information society” face a lot of stress. All the time the cellphone rings and emails arrive, then the WLAN is down, airplanes are late and the video projector’s lamp breaks just before the important PowerPoint® presentation.\nWhen it all gets too much it’s time to relax. But the word “relax” is a bit spoiled because it was taken over by the wellness industry. And some IT professionals wouldn’t like their colleagues imagining them laying in a hot tub with slices of cucumber on the eyelids.\nThis is where the word “underclocking” can help out. Overclocking means to run a computer processor at a higher speed than it was intended by modifying hardware or toggling switches in hidden menus: Only for real phreax! So underclocking is the way for the competent computer user to chill out "], 10146], ["http://contemporary-home-computing.org/affordance/", "Once Again, The Doorknob", ["text", "\tOnce Again, The Doorknob\tOnce Again, The Doorknob\nOn Affordance, Forgiveness and Ambiguity in Human Computer and Human Robot Interaction\nKeynote at Rethinking Affordance Symposium\nAkademie Schloss Solitude, 8 June 20181\nI think it is absolutely wonderful that there is an event about affordance and an idea that this concept could be rethought. I guess you invited me to talk as an artist who is critically reflecting on the medium she is working with. Indeed as a net artist I do my best to show the properties of the medium, and as a web archivist and Digital Folklore researcher I examine the way users deal with the world they’re thrown into by developers. I suggest we talk about these aspects later, during the Q and A session because it would be good to start in the more applied context of HCI and interface design, since this is where the term lives now and where it is discussed and interpreted. These interpretations affect crucial matters.\nThe following might s"], 46425], ["http://contemporary-home-computing.org/art-and-tech/not/", "Not Art&Tech", ["text", "\tNot Art&Tech\tNot Art&Tech\nOn the role of Media Theory at Universities of Applied Art, Technology and\tArt and Technology.\tOlia LialinaUniversität für angewandte Kunst Wien November 2015\nThank you for the chance to introduce my ideas. I’m a net artist, active in the field since 20 years, 16 of these years I am teaching new media designers at Merz Akademie. I’m also a co-author of the book Digital Folklore. Since the beginning of the century I collect, preserve and monumentalize the web culture of the 90’s. “What Does It Mean to Make a Web Page” is the doctoral thesis I work on right now.\nAs an artist, researcher and teacher I value user culture and medium specificity in both design and research, and as an every day routine. I see my work contributing to critical digital culture, media literacy and the development of languages and dialects of New Media.\nBut there are many obstacles on my way. Three years ago I grasped and boiled them down to three: technology, experience and peo"], 22990], ["http://contemporary-home-computing.org/RUE/", "Rich User Experience, UX and Desktopization of War", ["meta", "Every victory of experience design: a new product “telling the story,” or an interface meeting the “exact needs of the customer, without fuss or bother” widens the gap in between a person and a personal computer."], 28875], ["http://contemporary-home-computing.org/turing-complete-user/", "Turing Complete User", ["text", "\tTuring Complete User\tTuring Complete User\n“Any error may vitiate the entire output of the device. For the recognition and correction of such malfunctions intelligent human intervention will in general be necessary.”\n— John von Neumann, First Draft of a Report on the EDVAC, 1945\n“If you can’t blog, tweet! If you can’t tweet, like!”— Kim Dotcom, Mr. President, 2012\tInvisible and Very Busy\nComputers are getting invisible. They shrink and hide. They lurk under the skin and dissolve in the cloud. We observe the process like an eclipse of the sun, partly scared, partly overwhelmed. We divide into camps and fight about advantages and dangers of\tThe Ubiquitous.\tBut whatever side we take — we do acknowledge the significance of the moment.\nWith the disappearance of the computer, something else is silently becoming invisible as well — the User.\tUsers are disappearing as both phenomena and term, and this development is either unnoticed or accepted as progress — an evolutionary ste"], 36656], ["http://contemporary-home-computing.org/still-there/", "Still There", ["text", "\tStill There\tOlia LialinaStill There\tIntro\nRuins and Templates of Geocities\nRotterdam’s Internet Cafés\nThe Many Backgrounds of Hyves\tThis project was realized as part of the Research\nProgramme Communication in a Digital Age, Piet Zwart Institute, Willem de Kooning Academy / Research Center Creating 010, Rotterdam University.\nI would like to thank the teachers and students at the Piet Zwart Institute, Willem de Kooning Academy, Rotterdam University, and the Goethe Institute who helped facilitate my research. I would also like to personally thank Florian Cramer, Renée Turner, Leslie Robbins, Wendelien van Oldenborgh, Danja Vasiliev and JODI for being wonderful hosts and friends.\nAll images by the author, unless otherwise indicated. Text editing by Bart Plantenga. Brought to the web by Dragan Espenschied.\t➔\t"], 841], ["http://contemporary-home-computing.org/prof-dr-style/", "Prof. Dr. Style", ["meta", "It is difficult to estimate how many web pages created in 1993-1994 made it into the new millenium in their premordial way. If you manage to find something that was put online that time, it would in the best case display a 1995-1996 skin. But there is a way to find pages that live for ever in 1993."], 28740], ["http://contemporary-home-computing.org/vernacular-web-2/", "Olia Lialina: Vernacular Web 2", ["text", "\tOlia Lialina: Vernacular Web 2\tIn the beginning this article was an “index.html” saved in the “glitter” folder. Then it got the working title “The work of users in times of perfect templates”. Then it became “Rich User Experience for the Poor” and was presented at the New Network Theory conference. After the presentation, UCSB professor Alan Lui suggested to rename it to “Homesick”. But for the moment I'll leave it as\nVernacular Web 2\tDeutsche Version: Teil 1, Teil 2\tTwo years ago I wrote an article titled “A Vernacular\tWeb”, in which I tried to collect, classify and describe the most important elements of the early Web – visual as well as acoustic – and the habits of first Web users, their ideas of harmony and order.\nI’m talking about everything that became a subject of mockery by the end of the last century when professional designers arrived, everything that fell out of use and turns up every now and again as the elements of “retro” look in site design"], 21673], ["http://contemporary-home-computing.org/where-did-the-computer-go/", "Where did the computer go? — Part 1", ["text", "\tWhere did the computer go? — Part 1\tThe home computer as a cultural object is physically vanishing.\nThe home computer presents itself through several interfaces, some in software, some in hardware. While it is mostly assumed that these interfaces’ goals are to expose the computing capabilities of the system to its user, obviously interfaces are at the same time responsible for transporting the image of the machine.\nThe interfaces’ designs are not only driven by technical necessity and engineering decisions, but also by , current pictures of the ,\tor\tFor example, the Austrian born author and one of the earliest Chaos Computer Club members Peter Glaser frequently describes his fascination as a writer with early home computers as being able to\t—\twith a cathode ray and a phosphorized screen (also known as monitor or TV tube). Pure thought, pure data, freed from physical constraints!!\nLetters that appeared from out of the thin air on a TV seemed to be the aesthetic represent"], 6854], ["http://contemporary-home-computing.org/paza-janin-tendo-data-risotto/", "Paza review.html", ["text", "\tPaza review.html\tPaza: Janin Teno Data Risotto, Ninjanidiskus 2005\n1. Winning and losing has always been a big topic in pop music. However the meaning changed over the decades.\t2. Home computer music is a very old movement that only recently stepped out of a scene of nerdy youngsters who liked to spend their time playing video games and writing programs on Atari, Sinclair or Commodore computers. The home computing culture is quite different from nowadays typical computer usage, and knowledge about this is required to fully appreciate Paza’s album “Janin Tendo Data Risotto”.\n3. At the same time, home computer music has already developed far enough to be compared with “normal” pop music. This means for the area of critiques and reviews that pop music lovers must acquaint new knowledge about musicians and means of production they missed out on since more than 20 years. In parallel home computer musicians have to face new forms of analysis and criticism as their style rises t"], 10074], ["http://contemporary-home-computing.org/hyves/money/", "Hyves: The Money", ["text", "\tHyves: The Money\tHyves: The Money\nI was not an active Hyves user. So after I got a note that the service was to be closed on the 29th of November 2013 and there was one week to download the files, I personally didn't have a lot to worry about. But I looked around and carried out what I could. With this money we will build a social network that will never be sold to Yahoo, will not become a gaming portal and will allow animated GIFs in the backgrounds of user profiles!\tOlia Lialina, 25.11.2013\t"], 563], ["http://contemporary-home-computing.org/hyves/body-class-pimp/", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\tThe Dutch social network Hyves didn't chase it's users in white clean profiles (like Facebook), and it also didn't allow them to build their own web sites (like Geocities, Tumblr). Instead, for almost 10 years, it was going\twith the Pimp My Profile model (Myspace): users were allowed to change the avatar, colors of texts and other elements, background image and its position. Not a lot, but the users of Hyves developed the mastery of talking to the world through the choice and combination of userpic and wallpaper.\nOlia Lialina\t28.11.13\t(the last day you can request the archive of your hyves profile)\thyves:body class pimp\t"], 669], ["http://contemporary-home-computing.org/GIF-Timeline/", "Animated GIFs official Timeline", ["text", "\tAnimated GIFs official Timeline\tAnimated GIFs Timeline\nLast Updated 27 January 2018\tofficial | alternative\t"], 124], ["http://contemporary-home-computing.org/GAD/", "Gradient Appreciation Day - Google", ["text", "Gradient Appreciation Day - GoogleBack to Google Logos\n"], 55], ["http://contemporary-home-computing.org/CircleOfLife/", "The Circle of Life", ["text", "\tThe Circle of Life\t"], 28], ["http://contemporary-home-computing.org/car-metaphors/about", "Car Metaphors   » About", ["text", "\tCar Metaphors\t» About\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tAbout\tI teach Interface Design and Digital Cultures at a design school. Its a great job. The only thing that poisons my professional life are the numerous analogies I read every day in articles on new media and computer related topics.\nThe most popular analogy contemporary authors use to explain the computer’s development and its role in our life is\tto cars. In this blog, the car and other metaphors and comparisons will be collected. The examples will be in Russian, English and German, annotated and commented on in English.\nI would be happy to receive your feedback and examples as well. Please send in quotes\tfrom online or offline texts, old or new, not necessarily automobile related. Analogies to nature, film history, Darwinism and economic theory are appreciated.\tAnd please write to\tif you come across an interesting article, book,\tor text on digital cultu"], 2954], ["http://contemporary-home-computing.org/car-metaphors/archives", "Car Metaphors   » Archives", ["text", "\tCar Metaphors\t» Archives\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tMay 2013\t27: Junkie, as a Killer Anti “User” Argument (0) April 2013\t23: There is No Spoon (0) November 2012\t25: Fisherman analogy to explain analog (0) August 2012\t22: Blurring as a Mainstream Restoration Method (0) July 2012\t26: Now We Know (0)21: Metaphors — Haters’ Best Friends (0) March 2012\t13: Skeuomorphs\t(0) January 2012\t30: Nielsen about Chrome, not the browser (0)07: X for X-Files (0) December 2011\t30: Wheels are Good and Right! (0) November 2011\t30: A Mystery (2)19: Circle of UI (0)14: Books\t(0)13: Full of Tabs (0)12: The Last Nail in the Coffin of Car Analogies (0) August 2011\t08: Multimedia CD-ROM (3) November 2010\t28: Internet and Vacuum Cleaner (0) October 2010\t24: Web Design and Plastic Surgery (0)21: To dress as a hyperlink (0) June 2010\t28: Slow Media Slow Food (0) May 2010\t29: Dairy Products (1)20: On behalf of the futu"], 2245], ["http://contemporary-home-computing.org/car-metaphors/junkie-as-a-killer-anti-user-argument/", "Car Metaphors  » Blog Archive   » Junkie, as a Killer Anti “User” Argument", ["text", "\tCar Metaphors\t» Blog Archive\t» Junkie, as a Killer Anti “User” Argument\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tJunkie, as a Killer Anti “User” Argument\n2013-05-27 22:34\tby olia\tIn 2006, the “restless entrepreneur” Derek Powazek posted an all in all reasonable text on his blog, “Death to User-Generated Content”, in which he suggested to get rid of\tthe expression “user generated content” which was very actual back then and is still in use today. Good intention, this term is ugly and hypocritical. What reads strange though is the argumentation: The word user was announced to be bad, because user = junkie.\nI was reminded about it when I saw a tweet quoting the “galileo of graphics”, Edward Tufte:\tIt is very easy to attack the word “user” on this level. But what for? To call them customers and make them see themselves as customers?\nWhy are reputable thinkers not using their eloquence to distinguish computer users from dr"], 1950], ["http://contemporary-home-computing.org/car-metaphors/category/junkie/", "Car Metaphors   » junkie", ["text", "\tCar Metaphors\t» junkie\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “junkie” Category\tJunkie, as a Killer Anti “User” Argument\n2013-05-27 22:34\tby olia\tPosted in junkie,\tuser |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 330], ["http://contemporary-home-computing.org/car-metaphors/category/user/", "Car Metaphors   » user", ["text", "\tCar Metaphors\t» user\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “user” Category\tJunkie, as a Killer Anti “User” Argument\n2013-05-27 22:34\tby olia\tPosted in junkie,\tuser |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 326], ["http://contemporary-home-computing.org/car-metaphors/there-is-no-spoon/", "Car Metaphors  » Blog Archive   » There is No Spoon", ["text", "\tCar Metaphors\t» Blog Archive\t» There is No Spoon\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tThere is No Spoon\n2013-04-23 23:12\tby olia\tDutch product designer Niels Datema made a set of spoons for baking bread at home.\tWhen I look at them, I immediately think about modern apps. Not because Datema’s spoons are thin and shiny like mobile surfaces and interfaces (though it also adds to the mood), but because they are following the same paradigm, the same design intention to give users one tool for one task. This spoon is for flour, that one is for sugar. This is app is for writing poems, that one for writing prose. No ambiguity, no place for user improvisation.\tThese beautiful spoons will probably look very good in one’s kitchen. They can bring somebody who is afraid to make bread herself to the kitchen. But those spoons also suggest that there is only one recipe for bread or that you have to buy another combination of spoo"], 2190], ["http://contemporary-home-computing.org/car-metaphors/category/spoon/", "Car Metaphors   » spoon", ["text", "\tCar Metaphors\t» spoon\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “spoon” Category\tThere is No Spoon\n2013-04-23 23:12\tby olia\tPosted in spoon,\tmatrix |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 306], ["http://contemporary-home-computing.org/car-metaphors/category/matrix/", "Car Metaphors   » matrix", ["text", "\tCar Metaphors\t» matrix\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “matrix” Category\tThere is No Spoon\n2013-04-23 23:12\tby olia\tPosted in spoon,\tmatrix |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 308], ["http://contemporary-home-computing.org/car-metaphors/fisherman-analogy-to-explain-analog/", "Car Metaphors  » Blog Archive   » Fisherman analogy to explain analog", ["text", "\tCar Metaphors\t» Blog Archive\t» Fisherman analogy to explain analog\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tFisherman analogy to explain analog\n2012-11-25 12:39\tby olia\tInternet Archive provides Bits and Bytes, a Canadian television series, produced by TVOntario in 1983. It is “about computers, or rather about microcomputers — the small, personal ones that are selling like hot cakes nowadays.” Despite its cheesy header and the fact that it is 30 years old, the dialogs performed by Luba Goy\tand Billy Van are perfect explanations of basic and some times advanced principles of real time computing. And of course it is very 8-bit, from the title song to every single example shown. Well, it was still 8-bit times.\nEpisode 8, Simulations and Games is especially advanced. First of all it explains why games help to learn more about reality than simulations. Secondly, it explains in one minute the concept of digital and analog.\nAt "], 1814], ["http://contemporary-home-computing.org/car-metaphors/category/fisherman/", "Car Metaphors   » fisherman", ["text", "\tCar Metaphors\t» fisherman\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “fisherman” Category\tFisherman analogy to explain analog\n2012-11-25 12:39\tby olia\tPosted in fisherman |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 327], ["http://contemporary-home-computing.org/car-metaphors/blurring-as-a-mainstream-restoration-method/", "Car Metaphors  » Blog Archive   » Blurring as a Mainstream Restoration Method", ["text", "\tCar Metaphors\t» Blog Archive\t» Blurring as a Mainstream Restoration Method\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tBlurring as a Mainstream Restoration Method\n2012-08-22 12:47\tby olia\tThe art world is ROFLing about an epic fail that happened in Spain, at the Centro de Estudios Borjanos in Borja. A woman in her eighties restored, on her own initiative, according to her taste and skills, a 19th century painting. Read the story on EL PAIS in Spanish and on Gawker.\nWhatever naive and amateur the result might appear, we should acknowledge the fact that the lady was using a mainstream restoration technique for the digital age: blurring.\nLook how this technique is used by for instance art.sy, an online art platform that according to Forbes “has the potential to really shake up and transform the art industry”. Along with analog art they want to cover interactive art, screen works and net art. They received screen shots made by "], 2209], ["http://contemporary-home-computing.org/car-metaphors/category/amateurs/", "Car Metaphors   » amateurs", ["text", "\tCar Metaphors\t» amateurs\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “amateurs” Category\tBlurring as a Mainstream Restoration Method\n2012-08-22 12:47\tby olia\tPosted in amateurs |\tNo Comments »\tWho else is the cloud?\n2008-09-17 12:55\tby olia\tPosted in amateurs,\tnetwork,\tcloud,\ttime-sharing |\t3 Comments »\tA Bad Book\n2007-08-28 22:15\tby olia\tPosted in car,\tamateurs |\t2 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 543], ["http://contemporary-home-computing.org/car-metaphors/now-we-know/", "Car Metaphors  » Blog Archive   » Now We Know", ["text", "\tCar Metaphors\t» Blog Archive\t» Now We Know\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tNow We Know\n2012-07-26 22:19\tby olia\tNow we know how information highway looks and what its correct name is.\t← Metaphors — Haters’ Best Friends\nBlurring as a Mainstream Restoration Method →\tYou can follow any responses to this entry through the RSS 2.0 feed.\tYou can leave a response, or trackback from your own site.\tLeave a Reply\tName (required)\tMail (will not be published) (required)\tWebsite\tYou can use these tags: <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <code> <em> <i> <strike> <strong>\tEntries (RSS)\tand Comments (RSS).\t"], 780], ["http://contemporary-home-computing.org/car-metaphors/category/information-highway/", "Car Metaphors   » information highway", ["text", "\tCar Metaphors\t» information highway\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “information highway” Category\tNow We Know\n2012-07-26 22:19\tby olia\tPosted in information highway |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 333], ["http://contemporary-home-computing.org/car-metaphors/metaphors-haters-best-friends/", "Car Metaphors  » Blog Archive   » Metaphors — Haters’ Best Friends", ["text", "\tCar Metaphors\t» Blog Archive\t» Metaphors — Haters’ Best Friends\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tMetaphors — Haters’ Best Friends\n2012-07-21 22:37\tby olia\tUsually, when I read a book, next to the notes on content, I bookmark curious metaphors. This tactic didn’t work with The UNIX Haters Handbook I just finished. Every page, every paragraph of it is filled with sarcastic analogies. They are flowing and cascading. This handbook is such a metaphorical bacchanalia, I wouldn’t even know what to quote.\nSo I paste an excerpt from the Anti-Foreword, written by Dennis Ritchie, creator of C and co-creator of UNIX:\nHere is my metaphor: your book is a pudding stuffed with apposite observations, many well-conceived. Like excrement, it contains enough undigested nuggets of nutrition to sustain life for some. But\nit is not a tasty pie:\tit reeks too much of contempt and of envy.\nBon appetit!\t← Skeuomorphs\nNow We Know →\t"], 1433], ["http://contemporary-home-computing.org/car-metaphors/category/unix/", "Car Metaphors   » unix", ["text", "\tCar Metaphors\t» unix\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “unix” Category\tMetaphors — Haters’ Best Friends\n2012-07-21 22:37\tby olia\tPosted in unix |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 309], ["http://contemporary-home-computing.org/car-metaphors/skeuomorphs/", "Car Metaphors  » Blog Archive   » Skeuomorphs ", ["text", "\tCar Metaphors\t» Blog Archive\t» Skeuomorphs\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tSkeuomorphs\n2012-03-13 10:31\tby olia\tThe 5th page of Ars Technica’s Mac OS X 10.7 Lion review by John Siracusa “Here’s to the crazy ones” covers the GUI appearances of\tApple’s iCal and Adress Book software — extreme examples of metaphorical design. Both applications imitate real/paper objects by all means and in every pixel available.\nThe author talks about them as skeuomorphs, “derivative object[s] that retain ornamental design cues to a structure that was necessary in the original[s]”, as defined by OED. It is of course possible to see iCal in the row of classic skeuomorphs, as Siracusa and the Wikipedia article do, adding it to the row of decorative but ultimately useless rivets or wheel covers.\nBut following this logic we’d have to say that all metaphoric (not idiomatic) elements of user interfaces are skeuomorphic, because their onl"], 2220], ["http://contemporary-home-computing.org/car-metaphors/category/gui/", "Car Metaphors   » GUI", ["text", "\tCar Metaphors\t» GUI\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “GUI” Category\tSkeuomorphs\n2012-03-13 10:31\tby olia\tPosted in GUI,\tpaper,\tidiom,\tskeuomorph |\tNo Comments »\tNielsen about Chrome, not the browser\n2012-01-30 21:44\tby olia\tPosted in car,\tGUI |\tNo Comments »\tGoogle as Swiss Army Knife, but closed, but not any more\n2007-11-12 19:10\tby olia\tPosted in GUI,\tigoogle,\tswiss_knife |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 569], ["http://contemporary-home-computing.org/car-metaphors/category/paper/", "Car Metaphors   » paper", ["text", "\tCar Metaphors\t» paper\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “paper” Category\tSkeuomorphs\n2012-03-13 10:31\tby olia\tPosted in GUI,\tpaper,\tidiom,\tskeuomorph |\tNo Comments »\tBooks\n2011-11-14 18:09\tby olia\tPosted in paper,\tbook |\tNo Comments »\tPaperdigm: Paper Theater\n2010-03-17 11:01\tby olia\tPosted in web_design,\tpaper |\tNo Comments »\tPaperdigm: Flipping\n2010-03-08 23:01\tby olia\tPosted in paper |\tNo Comments »\tPaperdigm\n2010-03-03 13:22\tby olia\tPosted in history,\tpaper |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 675], ["http://contemporary-home-computing.org/car-metaphors/category/idiom/", "Car Metaphors   » idiom", ["text", "\tCar Metaphors\t» idiom\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “idiom” Category\tSkeuomorphs\n2012-03-13 10:31\tby olia\tPosted in GUI,\tpaper,\tidiom,\tskeuomorph |\tNo Comments »\tFull of Tabs\n2011-11-13 21:38\tby olia\tPosted in idiom,\tbrowser |\tNo Comments »\tTo dress as a hyperlink\n2010-10-21 11:18\tby olia\tPosted in hyperlink,\tfashion,\tidiom |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 521], ["http://contemporary-home-computing.org/car-metaphors/category/skeuomorph/", "Car Metaphors   » skeuomorph", ["text", "\tCar Metaphors\t» skeuomorph\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “skeuomorph” Category\tSkeuomorphs\n2012-03-13 10:31\tby olia\tPosted in GUI,\tpaper,\tidiom,\tskeuomorph |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 328], ["http://contemporary-home-computing.org/car-metaphors/nielsen-about-chrome-not-the-browser/", "Car Metaphors  » Blog Archive   » Nielsen about Chrome, not the browser", ["text", "\tCar Metaphors\t» Blog Archive\t» Nielsen about Chrome, not the browser\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tNielsen about Chrome, not the browser\n2012-01-30 21:44\tby olia\tI don’t know who came up with the term “chrome,” but it was likely a visual analogy with the use of metal chrome on big American cars during the 1950s: the car body (where you sit) was surrounded by shiny chrome on the bumpers, tail fins, and the like.\nSimilarly, in most modern GUIs, the chrome lives around the edges of the screen, surrounding the middle area, which is dedicated to the user’s data.\t← X for X-Files\nSkeuomorphs →\tYou can follow any responses to this entry through the RSS 2.0 feed.\tYou can leave a response, or trackback from your own site.\tLeave a Reply\tName (required)\tMail (will not be published) (required)\tWebsite\tYou can use these tags: <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title="], 1110], ["http://contemporary-home-computing.org/car-metaphors/category/car/", "Car Metaphors   » car", ["text", "\tCar Metaphors\t» car\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “car” Category\tNielsen about Chrome, not the browser\n2012-01-30 21:44\tby olia\tPosted in car,\tGUI |\tNo Comments »\tWheels are Good and Right!\n2011-12-30 23:33\tby olia\tPosted in car,\twheel |\tNo Comments »\tThe Last Nail in the Coffin of Car Analogies\n2011-11-12 21:44\tby olia\tPosted in car |\tNo Comments »\tH-Metaphor\n2008-09-26 10:59\tby olia\tPosted in car,\tAI,\thorse |\tNo Comments »\tA Bad Book\n2007-08-28 22:15\tby olia\tPosted in car,\tamateurs |\t2 Comments »\tDouglas Engelbart, the automobile and other analogies\n2007-08-26 15:37\tby olia\tPosted in car,\ttrain,\thistory,\tbicycle,\tviolin |\t1 Comment »\tGood Morning!\n2007-03-20 22:58\tby olia\tPosted in car,\tindustrial revolution,\thistory,\tdesign |\t2 Comments »\tSmell my tires!\n2007-03-16 13:37\tby olia\tPosted in car,\tlamborgh"], 1260], ["http://contemporary-home-computing.org/car-metaphors/x-for-x-files/", "Car Metaphors  » Blog Archive   » X for X-Files", ["text", "\tCar Metaphors\t» Blog Archive\t» X for X-Files\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tX for X-Files\n2012-01-07 22:48\tby olia\tI read a new article by Jacob Nielsen on overloaded commands and wondered how can it be that in 2012, at least two decades after Interface Design started to be considered a profession, one should write about incorrectness of using the same command (button, icon) to “achieve different (but similar) results” and\tcan provide examples from the world’s leading IT companies.\nAnd then I saw the tweet\t@mariuswatz The “X” button in the Facebook message does not mean “delete”. It means “archive”. Really, Facebook?\nI looked over the shoulder of the nearest\tfacebook user …\t… indeed, X for archiving. It is not different (but similar), not even just different, but exactly the opposite. I think Jacob Nielsen can fire himself, because in 2012 as in 1993, the WWW is still made by X-Files fans.\t← Wheels are Good"], 1491], ["http://contemporary-home-computing.org/car-metaphors/category/uncategorized/", "Car Metaphors   » Uncategorized", ["text", "\tCar Metaphors\t» Uncategorized\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “Uncategorized” Category\tX for X-Files\n2012-01-07 22:48\tby olia\tPosted in Uncategorized |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 317], ["http://contemporary-home-computing.org/car-metaphors/wheels-are-good-and-right/", "Car Metaphors  » Blog Archive   » Wheels are Good and Right!", ["text", "\tCar Metaphors\t» Blog Archive\t» Wheels are Good and Right!\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tWheels are Good and Right!\n2011-12-30 23:33\tby olia\tCory Doctorow gave a talk on the ideals of General Purpose Computing and attacks on them, at the 28C3, the Chaos Computer Congress in Berlin.\tTranscript by Joshua Wise.\nAmong other statements, Doctorow explains that you can’t regulate the internet and computers the same way you add and remove features from cars or smart phones.\nHe introduces a nice (even inspiring) analogy, by suggesting to see Information technology as a wheel, not as a car. He compares absurd, but more and more mainstream ideas to “fix the Internet so that it doesn’t run BitTorrent” with a fictional attempt to create a wheel that can have reduce uses.\n“If I wanted Congress to […] to regulate a wheel, it’s unlikely I’d succeed. If I turned up and said “well, everyone knows that wheels are good and right,"], 1974], ["http://contemporary-home-computing.org/car-metaphors/category/wheel/", "Car Metaphors   » wheel", ["text", "\tCar Metaphors\t» wheel\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “wheel” Category\tWheels are Good and Right!\n2011-12-30 23:33\tby olia\tPosted in car,\twheel |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 312], ["http://contemporary-home-computing.org/idioms/about", "Idioms   » About", ["text", "\tIdioms\t» About\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\tAbout\tWhen people talk about computers they use a lot of metaphors and idioms. The graphical user interface as well as the command line are full of such “images”. It starts with simple things as saying “to throw a file away” (into the “wastebasket”) and goes on to processes that have to be “killed” or changes that will be “forgotten”.\nSuch expressions might serve as bridges to understand what is happening inside a computer. However, an erroneous metaphor taken too far can cause a lot of trouble.\nAlso, metaphors popularize a conservative view on digital culture. When computers are continuously explained with cars, networks with highways, search engines with the human brain, even Email with classical postal service, the actual properties and possibilities of the computer are lost.\nThat is why this blog is trying to do it the other way round, to popularize idioms and metaphors"], 1527], ["http://contemporary-home-computing.org/idioms/archives", "Idioms   » Archives", ["text", "\tIdioms\t» Archives\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\tArchives\tMarch 2007\nFebruary 2007\tEntries (RSS)\tand Comments (RSS).\t"], 203], ["http://contemporary-home-computing.org/idioms/i-need-to-underclock-time-for-holidays/", "Idioms  » Blog Archive   » “I need to underclock.” — Time for holidays!", ["text", "\tIdioms\t» Blog Archive\t» “I need to underclock.” — Time for holidays!\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\t“I need to underclock.” — Time for holidays!\n2007-03-20 23:01\tby drx\tMost “knowledge workers” of “our information society” face a lot of stress. All the time the cellphone rings and emails arrive, then the WLAN is down, airplanes are late and the video projector’s lamp breaks just before the important PowerPoint® presentation.\nWhen it all gets too much it’s time to relax. But the word “relax” is a bit spoiled because it was taken over by the wellness industry. And some IT professionals wouldn’t like their colleagues imagining them laying in a hot tub with slices of cucumber on the eyelids.\nThis is where the word “underclocking” can help out. Overclocking means to run a computer processor at a higher speed than it was intended by modifying hardware or toggling switches in hidden menus: Only for real phreax! So undercl"], 1692], ["http://contemporary-home-computing.org/idioms/category/work/", "Idioms   » work", ["text", "\tIdioms\t» work\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\tArchive for the “work” Category\t“I need to underclock.” — Time for holidays!\n2007-03-20 23:01\tby drx\tPosted in work |\tNo Comments »\t“I defragged all the morning.” — I pretended to work.\n2007-03-04 14:52\tby drx\tPosted in work |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 426], ["http://contemporary-home-computing.org/idioms/lets-enlarge-committing-a-small-sin/", "Idioms  » Blog Archive   » “Let’s enlarge.” — Committing a small sin.", ["text", "\tIdioms\t» Blog Archive\t» “Let’s enlarge.” — Committing a small sin.\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\t“Let’s enlarge.” — Committing a small sin.\n2007-03-13 11:19\tby drx\tA system administrator working for a large company once told me the story that if the IT staff was about to decide whether to buy licenses for a new piece of software, first they would use a cracked version to try it out. This process was internally called enlarging because there were numerous offers for enlarging certain male body parts on the well known Armenian website they got their cracks from. The saying went: “Before we buy it we should enlarge it.”\nTo crack the copy protection of a commercial software is not exactly a legally endorsed activity, but the IT staff was feeling little guilt. They had the intention of buying big amounts of licenses after this evaluation process. The small sin they committed would lead to a greater good.\nIf something is"], 2019], ["http://contemporary-home-computing.org/idioms/category/ethics/", "Idioms   » ethics", ["text", "\tIdioms\t» ethics\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\tArchive for the “ethics” Category\t“Let’s enlarge.” — Committing a small sin.\n2007-03-13 11:19\tby drx\tPosted in ethics |\tNo Comments »\t“It’s a norton thing.” — It’s a two-faced case.\n2007-03-07 11:03\tby drx\tPosted in ethics |\t2 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 425], ["http://contemporary-home-computing.org/idioms/its-a-norton-thing-its-a-two-faced-case/", "Idioms  » Blog Archive   » “It’s a norton thing.” — It’s a two-faced case.", ["text", "\tIdioms\t» Blog Archive\t» “It’s a norton thing.” — It’s a two-faced case.\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\t“It’s a norton thing.” — It’s a two-faced case.\n2007-03-07 11:03\tby drx\tMany computer users are concerned about the dangers “viruses” and “worms” are causing on the internet. They read in computer magazines and see on the TV news that all the time new threats are appearing and their computer is under constant attack.\nSome are driven into the entwined arms of Peter Norton, a software publisher that earned his reputation in the 1980s with Norton Commander, a software that could almost make you think MS-DOS was an operating system.\nBut this was a long time ago. Today you can ask yourself if it is worse to have your computer slowed down by a virus itself or by Norton AntiVirus, a software so heavy and baroque that it makes the latest Duo Core processors scream. A virus at least needs your computer to send spam messages"], 4244], ["http://contemporary-home-computing.org/idioms/read-my-blog-get-lost/", "Idioms  » Blog Archive   » “Read my blog!” — Get lost!", ["text", "\tIdioms\t» Blog Archive\t» “Read my blog!” — Get lost!\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\t“Read my blog!” — Get lost!\n2007-03-06 10:32\tby drx\tYou can use “Read my blog!” to end any ongoing face to face conversation. It expresses that you do not want to spend more time on your conversation partner because this person is getting on your nerves and is wasting your time.\nThis phrase suggest that your conversation partner should switch from personal talk to a mass medium. Before the internet came along, only celebrities could say things like “I have to go, why don’t you read up on me in Vanity Fair? Bye!” Today everybody can act with the same arrogance by quickly setting up a mass medium and refer annoying people to it.\t← “The Hand Moves the Mouse.” — You control your destiny.\n“It’s a norton thing.” — It’s a two-faced case. →\tYou can follow any responses to this entry through the RSS 2.0 feed.\tYou can lea"], 1808], ["http://contemporary-home-computing.org/idioms/category/insults/", "Idioms   » insults", ["text", "\tIdioms\t» insults\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\tArchive for the “insults” Category\t“Read my blog!” — Get lost!\n2007-03-06 10:32\tby drx\tPosted in insults |\t3 Comments »\t“That lady was bitmapped!” — This woman is stupid.\n2007-02-20 21:48\tby drx\tPosted in insults |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 417], ["http://contemporary-home-computing.org/idioms/the-hand-moves-the-mouse-you-control-your-destiny/", "Idioms  » Blog Archive   » “The Hand Moves the Mouse.” — You control your destiny.", ["text", "\tIdioms\t» Blog Archive\t» “The Hand Moves the Mouse.” — You control your destiny.\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\t“The Hand Moves the Mouse.” — You control your destiny.\n2007-03-04 22:54\tby drx\tThrough a referrer link i learned about the Morning News’ Contest for Total Idioms, featuring an idiom that fits here:\nThe Hand Moves the Mouse\n“I guess I just always thought that if it was wrong, Word would underline it or something.” I.e., you’re responsible for the mistakes you make while using a computer.—Nathan Johnson\nNathan projects this idiom applied to mistakes made with a computer, but i suggest it should be used to express that people control their complete destiny. After learning that they can decide if they want to use Worms&Viruses Internet Explorer or install bloated crap Norton virus scanners, they can also decide what directions their lives should take in general.\t← “I defragged all the morning.” — I pretended "], 1477], ["http://contemporary-home-computing.org/idioms/category/destiny/", "Idioms   » destiny", ["text", "\tIdioms\t» destiny\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\tArchive for the “destiny” Category\t“The Hand Moves the Mouse.” — You control your destiny.\n2007-03-04 22:54\tby drx\tPosted in destiny |\tNo Comments »\t“The blocks didn’t fall right” — Something did not work out as it should have\n2007-02-25 21:46\tby drx\tPosted in destiny |\t4 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 472], ["http://contemporary-home-computing.org/idioms/i-defragged-all-the-morning-i-pretended-to-work/", "Idioms  » Blog Archive   » “I defragged all the morning.” — I pretended to work.", ["text", "\tIdioms\t» Blog Archive\t» “I defragged all the morning.” — I pretended to work.\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\t“I defragged all the morning.” — I pretended to work.\n2007-03-04 14:52\tby drx\t“Fragging” an enemy in a shooter game means to kill it, to blow it into pieces.\nBut there is also defragging, an activity mostly conducted in offices: employees are not actually working but just pretending to do so.\nThe term refers to “defragmenting the file system”, a maintenance function built into\tMicrosoft Windows. Originally it was serving the purpose of optimizing how the content of files is laid-out on the harddisk by moving parts of the same file close together so the read/write head of the harddisk wouldn’t have to move so much. If management personal would drop by and see the defragmentaion running, they wouldn’t notice that no work is being done as managers of course lack any technical knowledge and the classic defrag vi"], 1888], ["http://contemporary-home-computing.org/idioms/the-stones-didnt-fall-right-something-did-not-work-out-as-it-should-have/", "Idioms  » Blog Archive   » “The blocks didn’t fall right” — Something did not work out as it should have", ["text", "\tIdioms\t» Blog Archive\t» “The blocks didn’t fall right” — Something did not work out as it should have\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\t“The blocks didn’t fall right” — Something did not work out as it should have\n2007-02-25 21:46\tby drx\tTetris is one of the most played games of all time. The player is up against a (pseudo) random generator that determines what kind of “block” will be the next to fall down. And when the stones do not fall right, there is little else for the player to do than taking it with pride and trying to close the gap later on. (Or playing in a way that no matter what block should fall, there will always be a place for it, right!)\nTetris has been described to depict life already in many cases. It’s time to shake of the novelty of this comparison and just use it as an idiom as often as possible.\nInterestingly, newer variants of Tetris include their own story, with anthropomorphic cubes called “Mino"], 3751], ["http://contemporary-home-computing.org/idioms/wp-login.php?redirect_to=%2Fidioms%2Fwp-admin%2Fupload.php%3Fstyle%3Dinline%26tab%3Dbrowse-all%26action%3Dview%26ID%3D29%26post_id%3D5%26paged", "Idioms › Login", ["text", "\tIdioms › Login\tIdioms\tUsername:\tPassword:\tRemember me\tBack to Idioms\nLost your password?\t"], 116], ["http://contemporary-home-computing.org/idioms/that-lady-was-bitmapped-this-woman-is-stupid/", "Idioms  » Blog Archive   » “That lady was bitmapped!” — This woman is stupid.", ["text", "\tIdioms\t» Blog Archive\t» “That lady was bitmapped!” — This woman is stupid.\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\t“That lady was bitmapped!” — This woman is stupid.\n2007-02-20 21:48\tby drx\tIn 2001, Dwayne from Beige Records asked a woman in a Chicago Transit Authotity booth for a hint on what train to take to get home. The lady did not know anything and gave completely wrong directions. Later Dwayne said “That lady was bitmapped”, a nice way of vilifying her intellectual capabilities.\nBitmaps are computer graphics that are composed from two colors. Every pixel’s color is determined by just one bit. For example, if the bit is zero the pixel is white, if it is one the pixel is black. Computer images of today use at least 24 bits for every pixel and are referred to as “true color”. This was already the case in 2001, therefore calling somebody bitmapped could be considered a proper insult even back then. The picture of a brain a"], 1780], ["http://contemporary-home-computing.org/idioms/i-gonna-bang-the-bricks-drawing-money-from-an-atm/", "Idioms  » Blog Archive   » “I gonna bang the bricks!” — I will draw money from an ATM", ["text", "\tIdioms\t» Blog Archive\t» “I gonna bang the bricks!” — I will draw money from an ATM\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\t“I gonna bang the bricks!” — I will draw money from an ATM\n2007-02-08 13:47\tby drx\tEverybody knows how Mario from the Super Mario Brothers is getting money: He bangs against a brick with his head. In real life you can say that you “bang the bricks” if you go to an ATM to draw money from your bank account.\nThrough this you can not only express your taste in video gaming, but also hint to the fact that ATMs are in fact computers and operate by arbitrary rules. There could theoretically run any software inside. Maybe once you can play Super Mario on them, and if you win your mortgage rates will be lowered.\tIn the stupid video Mario in Vice City, at 00:37, Mario tries to bang bricks for coins in another game and fails. This video is bad because if favors a “realistic game” — Grand Theft Auto — over a more s"], 4502], ["http://contemporary-home-computing.org/idioms/category/money/", "Idioms   » money", ["text", "\tIdioms\t» money\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\tArchive for the “money” Category\t“I gonna bang the bricks!” — I will draw money from an ATM\n2007-02-08 13:47\tby drx\tPosted in money |\t14 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 324], ["http://contemporary-home-computing.org/still-there/intro.html", "Still There", ["text", "\tStill There\tOlia LialinaStill There\tIntro\nRuins and Templates of Geocities\nRotterdam’s Internet Cafés\nThe Many Backgrounds of Hyves\tIn September 1996, I came to Rotterdam to participate in the Dutch Electronic Art Festival – not as an artist yet but as a film curator, or, to say it better, as a film curator from Moscow who made a website for a film club. For many people, the mid-90s were all about going online, making websites, travelling to the East and to the West.[1]\nIt was my very first media art event. I was overwhelmed by the scope and scale of the interactive installations – the huge, loud constructions of Knowbotic Research; the scary performances of half-human, half-cyborg Stelarc; the trips in a virtual submarine that seemed so real, and other interactive and immersive stuff distributed throughout the city. The modern architecture of Rotterdam was truly enhanced by all of these futuristic objects with their surprises inside.\nOne of them – an inflatable intern"], 6518], ["http://contemporary-home-computing.org/still-there/geocities.html", "Ruins and Templates of Geocities", ["text", "\tRuins and Templates of Geocities\tOlia LialinaStill There\tIntro\nRuins and Templates of Geocities\nRotterdam’s Internet Cafés\nThe Many Backgrounds of Hyves\tThe free web hosting service GeoCities was founded by Beverly Hills Internet in July 1995, which exactly corresponds with the moment that the web left academia and started to become accessible to everyone. Users began learning Hyper Text Markup Language, and welcomed each other onto their “home pages” — the first personal websites.\nGeocities soon emerged as one of the most popular and inhabited places on the WWW and remained so until the late 90s. Yahoo! purchased it in January 1999, at the peak of dot.com fever.\nIn the new millennium, Geocities proved to be a bad investment for Yahoo!. Having a Geocities page basically became synonymous with dilettantism and bad taste. Moreover, the days of home pages were numbered as people drifted to social network profiles.\nTen years later, in April 2009, Yahoo! announced that it w"], 31087], ["http://contemporary-home-computing.org/still-there/belhuizen.html", "Rotterdam’s Internet cafés", ["text", "\tRotterdam’s Internet cafés\tOlia LialinaStill There\tIntro\nRuins and Templates of Geocities\nRotterdam’s Internet Cafés\nThe Many Backgrounds of Hyves\tTerms like “Internet café” or “cybercafé” bring us right back to the 90s along with phrases like “web page” or “digital divide”, which were invented to describe new hybrids involving analog and digital, virtual and real as well as the present and near future.\nIt’s not that these terms have grown obsolete. It’s rather that these 20th-century phenomena they once described have outgrown their terminology. They were born as metaphors, but over time turned into idioms, and their analog parts were the first lose their original meanings. People who did not witness the emergence of the web do not fully understand why browser content is still called a “page”. It’s has also become unclear what public internet access facilities have in common with cafés, yet we continue calling them “internet cafés” or “cybercafés”.\tInternet café i"], 63514], ["http://contemporary-home-computing.org/still-there/hyves.html", "The Many Backgrounds of Hyves", ["text", "\tThe Many Backgrounds of Hyves\tOlia LialinaStill There\tIntro\nRuins and Templates of Geocities\nRotterdam’s Internet Cafés\nThe Many Backgrounds of Hyves\tI knew that going to call shops would be quite challenging and that the day-to-day reality of this experience would make it difficult to\tignore the social issues and concentrate on the artefacts of digital folklore and low digital culture. At the same time, I secretly hoped that belhuizen would give me access to a different aspect of the internet – that places with names like Alhoceima, Amal, Agadir, Casablanca, Angada\twould open a door to the Arabic internet world for me. I was hoping to see websites and profiles made in the Arabic web design tradition which, I have heard, combines elements that have been floating around on the web since the Geocities days with a heavy application of glitter. I’ve heard that there are corporate websites out there that look like British singer M.I.A.’s videos[1] and that there are user "], 15794], ["http://contemporary-home-computing.org/vernacular-web-2/examples.html", "Olia's and Dragan's Comparative History of Classic Animated GIFs and Glitter Graphics", ["text", "\tOlia's and Dragan's Comparative History of Classic Animated GIFs and Glitter Graphics\t"], 206], ["http://contemporary-home-computing.org/hyves/body-class-pimp/voelmegoed.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/GIF-Timeline/index1.html", "Animated GIFs alternative Timeline", ["text", "\tAnimated GIFs alternative Timeline\tAnimated GIFs Timeline\nLast Updated 27th January 2018\tofficial | alternative\t"], 131], ["http://contemporary-home-computing.org/car-metaphors/2013/05/", "Car Metaphors   » 2013 » May", ["text", "\tCar Metaphors\t» 2013 » May\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for May, 2013\tJunkie, as a Killer Anti “User” Argument\n2013-05-27 22:34\tby olia\tPosted in junkie,\tuser |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 322], ["http://contemporary-home-computing.org/car-metaphors/2013/04/", "Car Metaphors   » 2013 » April", ["text", "\tCar Metaphors\t» 2013 » April\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for April, 2013\tThere is No Spoon\n2013-04-23 23:12\tby olia\tPosted in spoon,\tmatrix |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 304], ["http://contemporary-home-computing.org/car-metaphors/2012/11/", "Car Metaphors   » 2012 » November", ["text", "\tCar Metaphors\t» 2012 » November\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for November, 2012\tFisherman analogy to explain analog\n2012-11-25 12:39\tby olia\tPosted in fisherman |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 323], ["http://contemporary-home-computing.org/car-metaphors/2012/08/", "Car Metaphors   » 2012 » August", ["text", "\tCar Metaphors\t» 2012 » August\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for August, 2012\tBlurring as a Mainstream Restoration Method\n2012-08-22 12:47\tby olia\tPosted in amateurs |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 326], ["http://contemporary-home-computing.org/car-metaphors/2012/07/", "Car Metaphors   » 2012 » July", ["text", "\tCar Metaphors\t» 2012 » July\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for July, 2012\tNow We Know\n2012-07-26 22:19\tby olia\tPosted in information highway |\tNo Comments »\tMetaphors — Haters’ Best Friends\n2012-07-21 22:37\tby olia\tPosted in unix |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 400], ["http://contemporary-home-computing.org/car-metaphors/2012/03/", "Car Metaphors   » 2012 » March", ["text", "\tCar Metaphors\t» 2012 » March\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for March, 2012\tSkeuomorphs\n2012-03-13 10:31\tby olia\tPosted in GUI,\tpaper,\tidiom,\tskeuomorph |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 316], ["http://contemporary-home-computing.org/car-metaphors/2012/01/", "Car Metaphors   » 2012 » January", ["text", "\tCar Metaphors\t» 2012 » January\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for January, 2012\tNielsen about Chrome, not the browser\n2012-01-30 21:44\tby olia\tPosted in car,\tGUI |\tNo Comments »\tX for X-Files\n2012-01-07 22:48\tby olia\tPosted in Uncategorized |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 412], ["http://contemporary-home-computing.org/car-metaphors/2011/12/", "Car Metaphors   » 2011 » December", ["text", "\tCar Metaphors\t» 2011 » December\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for December, 2011\tWheels are Good and Right!\n2011-12-30 23:33\tby olia\tPosted in car,\twheel |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 316], ["http://contemporary-home-computing.org/car-metaphors/2011/11/", "Car Metaphors   » 2011 » November", ["text", "\tCar Metaphors\t» 2011 » November\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for November, 2011\tA Mystery\n2011-11-30 22:07\tby olia\tPosted in painting |\t2 Comments »\tCircle of UI\n2011-11-19 22:26\tby olia\tPosted in app,\tCLI,\tscrolling |\tNo Comments »\tBooks\n2011-11-14 18:09\tby olia\tPosted in paper,\tbook |\tNo Comments »\tFull of Tabs\n2011-11-13 21:38\tby olia\tPosted in idiom,\tbrowser |\tNo Comments »\tThe Last Nail in the Coffin of Car Analogies\n2011-11-12 21:44\tby olia\tPosted in car |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 671], ["http://contemporary-home-computing.org/car-metaphors/a-mystery/", "Car Metaphors  » Blog Archive   » A Mystery", ["text", "\tCar Metaphors\t» Blog Archive\t» A Mystery\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tA Mystery\n2011-11-30 22:07\tby olia\tWhy would an artist who “uses the internet as his canvas” and who has “internet” tattooed in his mouth, need this oil/acryl reference to explain what he feels?\t← Circle of UI\nWheels are Good and Right! →\tYou can follow any responses to this entry through the RSS 2.0 feed.\tYou can leave a response, or trackback from your own site.\t2 Responses to “A Mystery”\tAlistair Colling Says:\t2011-11-30 23:16\tIs it because similes are helpful in explaining one thing by using a different context?\tArtwork is always explained this way!\tKevin Says:\t2011-11-30 23:46\tBecause - too keep the metaphor - RR seams not to have any direct contact with paint\tLeave a Reply\tName (required)\tMail (will not be published) (required)\tWebsite\tYou can use these tags: <a hre"], 1156], ["http://contemporary-home-computing.org/car-metaphors/circle-of-ui/", "Car Metaphors  » Blog Archive   » Circle of UI", ["text", "\tCar Metaphors\t» Blog Archive\t» Circle of UI\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tCircle of UI\n2011-11-19 22:26\tby olia\tI recommend\treading Don Norman’s\tarticle “Gesture Wars“. It is a great review of scrolling and panning history from somebody who remembers.\tHe writes about confusion and chaos provoked by gesture innovations of Apple, Microsoft and Google and other vendors who feel that they have to implement their own design philosophy, especially when it comes to scrolling.\nNorman claims:\n“Not only is there incompatibility among the vendors, but given the lack of any cues on the devices, it is very difficult to remember the gestures. We are back to the days of command-line interfaces where everything had to be memorized, or looked up in a manual.”\tThat’s bitter! We think they do NUI (N for natural), but in fact it is\tCLI (with C for confusion this time).\t← Books\nA Mystery →\tYou can follow any responses"], 1403], ["http://contemporary-home-computing.org/car-metaphors/books/", "Car Metaphors  » Blog Archive   » Books ", ["text", "\tCar Metaphors\t» Blog Archive\t» Books\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tBooks\n2011-11-14 18:09\tby olia\t2011\t1994\nThe last illustration of the The UNIX-HATERS Handbook, p.316\t← Full of Tabs\nCircle of UI →\tYou can follow any responses to this entry through the RSS 2.0 feed.\tYou can leave a response, or trackback from your own site.\tLeave a Reply\tName (required)\tMail (will not be published) (required)\tWebsite\tYou can use these tags: <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <code> <em> <i> <strike> <strong>\tEntries (RSS)\tand Comments (RSS).\t"], 718], ["http://contemporary-home-computing.org/car-metaphors/full-of-tabs/", "Car Metaphors  » Blog Archive   » Full of Tabs", ["text", "\tCar Metaphors\t» Blog Archive\t» Full of Tabs\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tFull of Tabs\n2011-11-13 21:38\tby olia\t“Epic Win for Anonymous” is a nice book, written by a well informed author, namely Cole Stryker. Through almost 300 pages he keeps a very comfortable relation of obscurity and obviousness. As a result, his book contains valuable facts and observations for those who never sticked their noses out of Facebook and /b/tards themselves. It would be of interest for BBS sysops, their daughters and their boyfriens, to us and the rest of us.\nIt is absolutely actual — may be even too actual. Being very descriptive, it belongs to the circle of books that have to be read the same month or at least the same year they were published. Like the user’s guide “The Whole Internet” published\tand read in 1994. Like “Creating GeoCities Websites”, that costed $39.99 in 1999 and $0.01 in 2011.\nAnyway, I like the way Stryker"], 2458], ["http://contemporary-home-computing.org/car-metaphors/the-last-nail-in-the-coffin-of-car-analogies/", "Car Metaphors  » Blog Archive   » The Last Nail in the Coffin of Car Analogies", ["text", "\tCar Metaphors\t» Blog Archive\t» The Last Nail in the Coffin of Car Analogies\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tThe Last Nail in the Coffin of Car Analogies\n2011-11-12 21:44\tby olia\tIn 2007, I started this blog with a quote from Turkle’s introduction to the second edition of The Second Self (2004). She wrote:\nIt takes as a given that people once knew how their cars, televisions, or telephones worked and don’t know this any more, but that in the case of mechanical technology, such losses are acceptable. It insists however, that ignorance about the fundamentals of computation comes at too high a price.\nComputers are not cars, computer users are not drivers, the paperless office is not to be compared with the paperless toilet, and a computer interface is more complex than a door, with or without a knob. In the end of 2011 many still don’t care about it, but there is more and more said on differences in between artifacts"], 1832], ["http://contemporary-home-computing.org/car-metaphors/2011/08/", "Car Metaphors   » 2011 » August", ["text", "\tCar Metaphors\t» 2011 » August\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for August, 2011\tMultimedia CD-ROM\n2011-08-08 09:07\tby olia\tPosted in cd-rom,\tapp |\t3 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 303], ["http://contemporary-home-computing.org/car-metaphors/multimedia-cd-rom/", "Car Metaphors  » Blog Archive   » Multimedia CD-ROM", ["text", "\tCar Metaphors\t» Blog Archive\t» Multimedia CD-ROM\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tMultimedia CD-ROM\n2011-08-08 09:07\tby olia\tProfound Review of App Art, drawing Dragan Espenschied, 2011\nThough Dragan insists that there is nothing to add to his “Profound Review of App Art”,\nI’ll\telaborate a bit. Fortunately we are not the only nor the first ones to notice that all this interactive entertainment that comes in the form of Apps is so much the same crap that we (net artists) fought 15 years ago.\tHere is a quote from the Interfacelab.com review of the Wired Magazine App:\n“However, what strikes me most about the Wired app is how amazingly similar it is to a multimedia CD-ROM from the 1990′s. This is not a compliment and actually turns out to be a fairly large problem […]\nThe only real differentiation between the Wired application and a multimedia CD-ROM is the delivery mechanism: you download it via the App Store vers"], 3775], ["http://contemporary-home-computing.org/car-metaphors/2010/11/", "Car Metaphors   » 2010 » November", ["text", "\tCar Metaphors\t» 2010 » November\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for November, 2010\tInternet and Vacuum Cleaner\n2010-11-28 00:16\tby olia\tPosted in vacuum_cleaner |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 320], ["http://contemporary-home-computing.org/car-metaphors/internet-and-vacuum-cleaner/", "Car Metaphors  » Blog Archive   » Internet and Vacuum Cleaner", ["text", "\tCar Metaphors\t» Blog Archive\t» Internet and Vacuum Cleaner\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tInternet and Vacuum Cleaner\n2010-11-28 00:16\tby olia\tThis week I was supposed to take part in the Digital Culture podium discussion organized by the cultural wing of SPD, but I failed to make it to Berlin and I really regret it. Because I missed Geert Lovink — founding Director of Institute of Network Cultures and a lot of important stuff\t— comparing Internet with Vacuum cleaner.\n“Der ist ja auch einfach da und wir nutzen ihn, statt ständig über seinen Sinn und seinen Aufbau zu diskutieren.” Dieselbe Einstellung wünscht sich Lovink auch zum Internet.\t“‘It (the vacuum cleaner) is just there, and we use it instead of discussing its meaning and structure.’ Lovink wishes that we adapt this attitude towards the Internet as well. ” — a journalist reports. I’ve asked Geert by email if this journalist has maybe misinterpreted his"], 2307], ["http://contemporary-home-computing.org/car-metaphors/2010/10/", "Car Metaphors   » 2010 » October", ["text", "\tCar Metaphors\t» 2010 » October\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for October, 2010\tWeb Design and Plastic Surgery\n2010-10-24 13:13\tby olia\tPosted in web_design,\tplastic_surgery |\tNo Comments »\tTo dress as a hyperlink\n2010-10-21 11:18\tby olia\tPosted in hyperlink,\tfashion,\tidiom |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 448], ["http://contemporary-home-computing.org/car-metaphors/web-design-and-plastic-surgery/", "Car Metaphors  » Blog Archive   » Web Design and Plastic Surgery", ["text", "\tCar Metaphors\t» Blog Archive\t» Web Design and Plastic Surgery\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tWeb Design and Plastic Surgery\n2010-10-24 13:13\tby olia\tTime has come, I’d like to draw an analogy myself. Not that I think that Web Design and Plastic Surgery have a lot in common. But representatives of both professions share a certain irresponsible attitude when it comes to making things look better. Victims of nose and lip jobs, lifting and Botox look at us from glossy pages and big screens.\tCosmetic procedures don’t always lead to the ridiculous results, mostly to predictable ones. Clients want to look better or younger or sexier, but instead they get generic “after plastic”, “professionally made” look.\nIt is the same with redesigning websites. The history of professional web design starts with redesigning amateur pages. And like plastic surgeons would always make the same — nose smaller, tits & lips bigger– web de"], 2355], ["http://contemporary-home-computing.org/car-metaphors/to-dress-as-a-hyperlink/", "Car Metaphors  » Blog Archive   » To dress as a hyperlink", ["text", "\tCar Metaphors\t» Blog Archive\t» To dress as a hyperlink\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tTo dress as a hyperlink\n2010-10-21 11:18\tby olia\tMembers of the Beautiful Zeros and Ugly Ones love to dress properly. We watch Internet memes closely and order T-shirts with the most obscure motives, to scare the noobz and to show that we belong to the WWW to those who also do. But last Wednesday at the Trailblazers#3 web surfing event, all our efforts were defeated by the outfit of one of the surfers. This musician named Roglok, came dressed as a hyperlink: blue jacket over purple T-shirt. These are classic default colors of the links and visited (followed) links, introduced by Netscape in 1995.\tExpressions like “I dress like a link today” — meaning to choose blue palette for your clothes — and other jokes we made that evening would be a great topic for the Computer Idioms watch blog, if it would be still updated.\nWhat inter"], 2398], ["http://contemporary-home-computing.org/car-metaphors/2010/06/", "Car Metaphors   » 2010 » June", ["text", "\tCar Metaphors\t» 2010 » June\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for June, 2010\tSlow Media Slow Food\n2010-06-28 19:08\tby olia\tPosted in food |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 295], ["http://contemporary-home-computing.org/car-metaphors/slow-media-slow-food/", "Car Metaphors  » Blog Archive   » Slow Media Slow Food", ["text", "\tCar Metaphors\t» Blog Archive\t» Slow Media Slow Food\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tSlow Media Slow Food\n2010-06-28 19:08\tby olia\tLike “Slow Food”, Slow Media are not about fast consumption but about choosing the ingredients mindfully and preparing them in a concentrated manner. Slow Media are welcoming and hospitable. They like to share.\nWith all respect to mono-tasking, and claim for conscious approach to\nmedia consumption and production: Why it happened that in 2010 (1024\nyears after digital revolution) a group of new-media-aware people is\nbrining their message across though food analogies?\t← Dairy Products\nTo dress as a hyperlink →\tYou can follow any responses to this entry through the RSS 2.0 feed.\tYou can leave a response, or trackback from your own site.\tLeave a Reply\tName (required)\tMail (will not be published) (required)\tWebsite\tYou can use these tags: <a h"], 1158], ["http://contemporary-home-computing.org/car-metaphors/2010/05/", "Car Metaphors   » 2010 » May", ["text", "\tCar Metaphors\t» 2010 » May\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for May, 2010\tDairy Products\n2010-05-29 16:07\tby olia\tPosted in food |\t1 Comment »\tOn behalf of the future\n2010-05-20 18:47\tby olia\tPosted in history,\tcyberspace |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 391], ["http://contemporary-home-computing.org/car-metaphors/dairy-products/", "Car Metaphors  » Blog Archive   » Dairy Products", ["text", "\tCar Metaphors\t» Blog Archive\t» Dairy Products\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tDairy Products\n2010-05-29 16:07\tby olia\tWhat a precious finding!\nBeside the fact that the question here should be why to use any version of Internext Explorer at all. And beside feeling really sorry for the company that has to compare their product with old milk and not with old wine. Beside all this, isn’t it ridiculous to look for what ever analogies in order to explain that an older version of the browser has to be replaced with a new one? 17 years of web browser history are nothing else than releases of new versions that make previous ones obsolete. Web browsers from Mosaic to Chrome can serve as a perfect metaphor for anything that has a very short shelf life.\tMilk is an important issue in contemporary online culture.\t← On behalf of the future\nSlow Media Slow Food →\tYou can follow any responses to this entry through the "], 1582], ["http://contemporary-home-computing.org/car-metaphors/on-behalf-of-the-future/", "Car Metaphors  » Blog Archive   » On behalf of the future", ["text", "\tCar Metaphors\t» Blog Archive\t» On behalf of the future\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tOn behalf of the future\n2010-05-20 18:47\tby olia\tFebruary 8, 1996\n“Governments of the Industrial World, you weary giants of flesh and steel, I come from Cyberspace, the new home of Mind. On behalf of the future, I ask you of the past to leave us alone. You are not welcome among us. You have no sovereignty where we gather.”\nMay 18, 2010\t← Power Utility vs. Information Utility\nDairy Products →\tYou can follow any responses to this entry through the RSS 2.0 feed.\tYou can leave a response, or trackback from your own site.\tLeave a Reply\tName (required)\tMail (will not be published) (required)\tWebsite\tYou can use these tags: <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <code> <em> <i> <strike> <strong>\tEntries (RSS)\tand Comments (RSS).\t"], 997], ["http://contemporary-home-computing.org/car-metaphors/2010/04/", "Car Metaphors   » 2010 » April", ["text", "\tCar Metaphors\t» 2010 » April\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for April, 2010\tPower Utility vs. Information Utility\n2010-04-06 21:53\tby olia\tPosted in energy,\tcloud,\ttime-sharing |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 339], ["http://contemporary-home-computing.org/car-metaphors/power-utility-vs-information-utility/", "Car Metaphors  » Blog Archive   » Power Utility vs. Information Utility", ["text", "\tCar Metaphors\t» Blog Archive\t» Power Utility vs. Information Utility\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tPower Utility vs. Information Utility\n2010-04-06 21:53\tby olia\tIn times of cloud computing and the rise of ultimate information utilities, we hear again and again about the history of electricity. The parallel is drawn in between private waterwheels that had to give way to power plants and personal computers that had to become dumb terminals. There is a whole great book by Nicholas Carr, The Big Switch, that tells the stories of electric current and computer power becoming utilities.\n“What happened to the generation of power a century ago is now happening to the processing of information” p.12\nThe comparison is fully legitimate. But still its important to remember that electric power and computational power are not the same thing.\tThe director of MIT’s time sharing project MAC, Robert Fano, wisely noticed the pri"], 1803], ["http://contemporary-home-computing.org/car-metaphors/2010/03/", "Car Metaphors   » 2010 » March", ["text", "\tCar Metaphors\t» 2010 » March\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for March, 2010\tPaperdigm: Paper Theater\n2010-03-17 11:01\tby olia\tPosted in web_design,\tpaper |\tNo Comments »\tIt just feels right\n2010-03-13 16:39\tby olia\tPosted in materialization |\tNo Comments »\tPaperdigm: Flipping\n2010-03-08 23:01\tby olia\tPosted in paper |\tNo Comments »\tPaperdigm\n2010-03-03 13:22\tby olia\tPosted in history,\tpaper |\t1 Comment »\tThe Problem with Metaphors\n2010-03-02 13:39\tby olia\tPosted in web_design,\tdesktop,\tnavigation,\tcommunity |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 718], ["http://contemporary-home-computing.org/car-metaphors/paperdigm-paper-theater/", "Car Metaphors  » Blog Archive   » Paperdigm: Paper Theater", ["text", "\tCar Metaphors\t» Blog Archive\t» Paperdigm: Paper Theater\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tPaperdigm: Paper Theater\n2010-03-17 11:01\tby olia\tIn spring 2009, students of my Security by Obscurity project were digging into the looks and poetics of online security and the way we are made to believe that we are safe or in danger. Of course Schneier on Security was among our primary readings. The book is a collection of Bruce Schneier’s commentaries from the last decade, most can also be found online. For example the one that provoked a lot of interesting discussions — Praise of Security Theater where Schneier explains the term: Security Theater is “security primarily designed to make you feel more secure.”\nThinking about examples of Security Theater we very soon arrived at the huge field of paper simulation on screen. To look more official, more personal, more trustworthy, more real, designers put digital content on a ba"], 2279], ["http://contemporary-home-computing.org/car-metaphors/it-just-feels-right/", "Car Metaphors  » Blog Archive   » It just feels right", ["text", "\tCar Metaphors\t» Blog Archive\t» It just feels right\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tIt just feels right\n2010-03-13 16:39\tby olia\t“It just feels right to hold the Internet in your hands”\n“This, Jen, is the Internet.”\t← Paperdigm: Flipping\nPaperdigm: Paper Theater →\tYou can follow any responses to this entry through the RSS 2.0 feed.\tYou can leave a response, or trackback from your own site.\tLeave a Reply\tName (required)\tMail (will not be published) (required)\tWebsite\tYou can use these tags: <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <code> <em> <i> <strike> <strong>\tEntries (RSS)\tand Comments (RSS).\t"], 778], ["http://contemporary-home-computing.org/car-metaphors/paperdigm-flipping/", "Car Metaphors  » Blog Archive   » Paperdigm: Flipping", ["text", "\tCar Metaphors\t» Blog Archive\t» Paperdigm: Flipping\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tPaperdigm: Flipping\n2010-03-08 23:01\tby olia\t1977:\t“A book can be read through the Dynabook […]. It need not be treated as a simulated paper book since this is a new medium with new properties.”\nAdele Goldberg, Alan Kay: “Personal Dynamic Media”, via The New Media Reader\n2010:\tThe effect of simulating turning pages is very popular online, especially with web sites that want to appear like magazines.\nTypical demo, typical implementation.\nThe only really good application though is Rafael Rozendal’s colorflip, abstract, useless, primitive, absurd but totally immersive experience.\nBut now the new contender for most absurd use of page flipping on a screen is the e-book reader on the iPad (see animation above). iPad shows only one page. When you flip, print on the backside of the paper becomes visible — as if you’re about to see a dou"], 1611], ["http://contemporary-home-computing.org/car-metaphors/paperdigm/", "Car Metaphors  » Blog Archive   » Paperdigm", ["text", "\tCar Metaphors\t» Blog Archive\t» Paperdigm\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tPaperdigm\n2010-03-03 13:22\tby olia\tThis is Ted Nelson’s explicit answer to those who simulate paper on screens, copied from Dream Machines (1987, p.28). In the 1980’s Nelson was warning software developers that it won’t end up good if they don’t set users and screens “free from the dimensions and topology of paper”. As we know he was not heard and the last twenty something years we were mostly exploiting our screens to produce content that would look good on paper, or will look like paper on screen.\nNelson’s newest book Geeks Bearing Gifts (2008/2009) is devoted to uncovering the real history of What We Got. It\tprovides an alternative computer history, a sarcastic time-line: from a prehistory rooted in ancient religions to modern computing starting in 1970 with UNIX. And sort of ending (or going in to the totally wrong paper direction) fro"], 2880], ["http://contemporary-home-computing.org/car-metaphors/the-problem-with-metaphors/", "Car Metaphors  » Blog Archive   » The Problem with Metaphors", ["text", "\tCar Metaphors\t» Blog Archive\t» The Problem with Metaphors\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tThe Problem with Metaphors\n2010-03-02 13:39\tby olia\tIn the short note “The Problem with Metaphors” in Dream Machines, Ted Nelson writes:\t“…a bunch of windows on the screen is called a “desktop metaphor”, since it looks to some people like paper on a desk. […]What matters is the best way to detail the virtuality, not finding a relationship to anything that came before. The best new virtualities will have no antecedents.” (p.69)\nIn 2005 Peter Morville unmasks the Navigaton metaphor* on the web as limiting and counterproductive in his book Ambient Findability. There is “no there there” and thats why there is no sense in drawing a map the web. Web maps are popular as subway map style posters or as interactive dots connected with thin lines in the form of a flash animation. But they do not give more than pretty pictures.\nMorvile"], 2119], ["http://contemporary-home-computing.org/car-metaphors/2010/02/", "Car Metaphors   » 2010 » February", ["text", "\tCar Metaphors\t» 2010 » February\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for February, 2010\tSkate the Web\n2010-02-28 22:03\tby olia\tPosted in surfing,\tsnowboarding,\tskating |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 324], ["http://contemporary-home-computing.org/car-metaphors/skate-the-web/", "Car Metaphors  » Blog Archive   » Skate the Web", ["text", "\tCar Metaphors\t» Blog Archive\t» Skate the Web\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tSkate the Web\n2010-02-28 22:03\tby olia\tOriginally the web was supposed to be browsed, but in fact it was “surfed”. Unfortunately not for long. All the fun to follow link after link and immerse in sudden findings was soon delegated to search engine bots. And gradually the WWW was rebuild in a way that is inhuman — pages with no links or with zombie links. So those of us who remember how to surf and are willing to do it can fall into frustration. To find like-minded people and have fun it is recommended to join a surf club*, to go to a web surfing event, or to organize one.\nThere is no cool sports metaphor for typing keywords and getting search results. So it is prosaically called googling.\nEight years ago, on the peak of the blogging revolution, Henry Jenkins suggested that blogging is as awesome as snowboarding, but this brave comparison"], 5078], ["http://contemporary-home-computing.org/car-metaphors/2009/04/", "Car Metaphors   » 2009 » April", ["text", "\tCar Metaphors\t» 2009 » April\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for April, 2009\tApproved by the Pope\n2009-04-08 08:00\tby olia\tPosted in religion |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 301], ["http://contemporary-home-computing.org/car-metaphors/approved-by-the-pope/", "Car Metaphors  » Blog Archive   » Approved by the Pope", ["text", "\tCar Metaphors\t» Blog Archive\t» Approved by the Pope\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tApproved by the Pope\n2009-04-08 08:00\tby olia\tFirefox security icon as it appears on their homepage. (08.04.09)\tFirefox security icon on the security page. (08.04.09)\tVatican’s coat of Arms.\nBrowsing with\tFirefox now I’m not only feeling safe, but I’m certain that I’m doing the The Right Thing.\t← Hackers and …\nSkate the Web →\tYou can follow any responses to this entry through the RSS 2.0 feed.\tYou can leave a response, or trackback from your own site.\tLeave a Reply\tName (required)\tMail (will not be published) (required)\tWebsite\tYou can use these tags: <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <code> <em> <i> <strike> <strong>\tEntries (RSS)\tand Comments (RSS).\t"], 930], ["http://contemporary-home-computing.org/car-metaphors/2009/03/", "Car Metaphors   » 2009 » March", ["text", "\tCar Metaphors\t» 2009 » March\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for March, 2009\tHackers and …\n2009-03-08 13:08\tby olia\tPosted in hackers,\tyugoslavia |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 306], ["http://contemporary-home-computing.org/car-metaphors/hackers-and/", "Car Metaphors  » Blog Archive   » Hackers and …", ["text", "\tCar Metaphors\t» Blog Archive\t» Hackers and …\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tHackers and …\n2009-03-08 13:08\tby olia\tPaul Graham’s Hackers and Painters, published by O’Reilly Media in 2004, gives insight on earning money in the Cloud (though the term is not used), on computer languages and software design. Probably its most known for the first chapter “Why Nerds are unpopular” which explains very good why teenagers (not only nerds) are unhappy.\nAs the title suggests, it is full of analogies. Indeed, he compares Stalin with Hitler, Cobol with Neanderthal language, Porsche 911 with Roman Pantheon (both are funny), Florence of the 15th century with New York of the 20th. Good hackers with Leonardo and Jane Austen, and bad hackers, who are too lazy to start a startup, with cows who still believe in current running through fence. And of course hacking with painting and architecture.\nMy attention\twas attracted by the fo"], 2818], ["http://contemporary-home-computing.org/car-metaphors/2008/11/", "Car Metaphors   » 2008 » November", ["text", "\tCar Metaphors\t» 2008 » November\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for November, 2008\tMistake #9\n2008-11-09 20:12\tby olia\tPosted in web_design |\t5 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 298], ["http://contemporary-home-computing.org/car-metaphors/mistake-9/", "Car Metaphors  » Blog Archive   » Mistake #9", ["text", "\tCar Metaphors\t» Blog Archive\t» Mistake #9\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tMistake #9\n2008-11-09 20:12\tby olia\tIn Top Ten Mistakes of Web Design Jacob Nielsen mentions Opening New Browser Windows. It’s mistake number 9. In my eyes it would have to be number One. Or number Two if Nielsen would have mentioned Zombie Links, links that lead to the same page that is already displayed. They are in fact The Mistake number One. But for some strange reason Nielsen is ignoring them already for 12 years.\nTo explain what is so evil about New Browser Windows, Nielsen says:\n“Opening up new browser windows is like a vacuum cleaner sales person who starts a visit by emptying an ash tray on the customer’s carpet.”\nTerrible sales people, who come without invitation and difficult to get rid of; New Browser Windows are terrible in the same way. And now think about Zombie Links, they are like the same Vacuum Cleaner Sales Person appea"], 3072], ["http://contemporary-home-computing.org/car-metaphors/2008/09/", "Car Metaphors   » 2008 » September", ["text", "\tCar Metaphors\t» 2008 » September\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for September, 2008\tH-Metaphor\n2008-09-26 10:59\tby olia\tPosted in car,\tAI,\thorse |\tNo Comments »\tThe most unappetizing analogy, open cola and free beer\n2008-09-19 10:19\tby olia\tPosted in OSS,\tfood |\t1 Comment »\tWho else is the cloud?\n2008-09-17 12:55\tby olia\tPosted in amateurs,\tnetwork,\tcloud,\ttime-sharing |\t3 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 557], ["http://contemporary-home-computing.org/car-metaphors/h-metaphor/", "Car Metaphors  » Blog Archive   » H-Metaphor", ["text", "\tCar Metaphors\t» Blog Archive\t» H-Metaphor\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tH-Metaphor\n2008-09-26 10:59\tby olia\tI think there is no other person writing about computers and interfaces who would make as many car analogies in their life as Don Norman did. But this is a thing of the past; since automobiles are totally computerized, there is hardly any chance to compare one to another.\tNorman’s\tlatest book The Design of Future Things introduces the state of today’s relations in between smart vehicles and their once smart drivers. And though he almost exclusively writes about automobiles, it reads like an outline for HCI in general. After all the automobile is a computers on wheels, and quite in\tfront of other environments awaiting total augmentation. “What is in the automobile today will be in the kitchen, bathroom and living room tomorrow.”\t(p.157)\nIn Future Things Norman mentions the H-Metaphor. Here is a paper T"], 2619], ["http://contemporary-home-computing.org/car-metaphors/the-most-unappetizing-analogy-open-cola-and-free-beer/", "Car Metaphors  » Blog Archive   » The most unappetizing analogy, open cola and free beer", ["text", "\tCar Metaphors\t» Blog Archive\t» The most unappetizing analogy, open cola and free beer\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tThe most unappetizing analogy, open cola and free beer\n2008-09-19 10:19\tby olia\tLawrence Lessig:\t“Proprietary software is like Kentucky Fried Chicken. Open source and free software is like Kentucky Fried Chicken sold with the “original secret recipe” printed in bold on the box.”\nFound via Infotopia by Cass R. Sunstein. On page 165 he mentions this comparison as “illuminating”. In my eyes it’s only offensive if anything.\nSunstein himself uses a better example of proprietary product: Coca Cola and and its open source embodiment — Open Cola.\tOpen Cola is a proper product of the Open Source Age.\tBut there is more\t— Free Beer — a true gift\tfor those who followed free and open source\tdiscourses for the last 15 years and know by heart Richard Stallman’s glorious analogy\tWhen we speak of “free soft"], 2268], ["http://contemporary-home-computing.org/car-metaphors/who-else-is-the-cloud/", "Car Metaphors  » Blog Archive   » Who else is the cloud?", ["text", "\tCar Metaphors\t» Blog Archive\t» Who else is the cloud?\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tWho else is the cloud?\n2008-09-17 12:55\tby olia\tSince the beginning of time, in a typical network diagram the Internet is shown as a cloud. in 2008 this fact was brought to our attention\tto explain the new trend — The Cloud.\nThe Cloud came to replace the ugly Web 2.0. But not only. It’s happily used as a new name for the Internet and shows a new understanding of what the networks of networks should be.\nThe new buzzword is indeed beautiful, you can’t compare it with the techy sounding Web 2.0, though this time we actually deal with a quite good defined technical term, meaning “computing provided as online utility”. But The Cloud — is charming and, I’d even say, sedative.\tCloud gained its positive image with Internet users in times when they were the person of the year. It stands for an Internet of peers. Cloud is the Internet "], 5825], ["http://contemporary-home-computing.org/car-metaphors/2008/08/", "Car Metaphors   » 2008 » August", ["text", "\tCar Metaphors\t» 2008 » August\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for August, 2008\tCloud for 5 computers\n2008-08-05 18:32\tby olia\tPosted in history,\tcloud,\ttime-sharing |\t1 Comment »\tIn the phase of the aeroplane\n2008-08-04 20:10\tby olia\tPosted in airplane,\tcloud |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 432], ["http://contemporary-home-computing.org/car-metaphors/cloud-for-5-computers/", "Car Metaphors  » Blog Archive   » Cloud for 5 computers", ["text", "\tCar Metaphors\t» Blog Archive\t» Cloud for 5 computers\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tCloud for 5 computers\n2008-08-05 18:32\tby olia\t“In a sense,” says Yahoo Research Chief Prabhakar Raghavan, “there are only five computers on earth.” He lists Google, Yahoo, Microsoft, IBM, and Amazon.\nWhat a pity that\tnow, when we are so close to Time Sharing again, Wikipedia announces that Watson’s statemant “I think there is a world market for about five computers”\tis a myth!\t← In the phase of the aeroplane\nWho else is the cloud? →\tYou can follow any responses to this entry through the RSS 2.0 feed.\tYou can leave a response, or trackback from your own site.\tOne Response to “Cloud for 5 computers”\ttobi-x Says:\t2008-08-11 04:18\tI’m afraid the Facebook computer needs to be listed soon, too. Their Matrix really sucks people in. ( Facebook is the new AOL )\tLeave a Reply\tName (re"], 1248], ["http://contemporary-home-computing.org/car-metaphors/in-the-phase-of-the-aeroplane/", "Car Metaphors  » Blog Archive   » In the phase of the aeroplane", ["text", "\tCar Metaphors\t» Blog Archive\t» In the phase of the aeroplane\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tIn the phase of the aeroplane\n2008-08-04 20:10\tby olia\tIn his contribution for Encyclopédie Française World Brain: The Idea of a Permanent World Encyclopedia, H.G. Wells states: “Our contemporary encyclopaedias are still in the coach-and-horses phase of development, rather than in the phase of the automobile and the aeroplane.” This text was written in 1937 and is compared with Vannevar Bush’s “As We May Think” due to its influence on the bright minds working on information storage, retrieval and processing optimization, augmentation and hypertext.\nComputer-Aeroplane/Airplane analogies were never\tcommon. There are cars to make comparisons from the everyday life of computer users and rockets if it comes to futuristic visions and ultimate capacities.\nThere was a funny episode early this year though. Donald Norman, author o"], 2971], ["http://contemporary-home-computing.org/car-metaphors/2007/11/", "Car Metaphors   » 2007 » November", ["text", "\tCar Metaphors\t» 2007 » November\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for November, 2007\tGoogle as Swiss Army Knife, but closed, but not any more\n2007-11-12 19:10\tby olia\tPosted in GUI,\tigoogle,\tswiss_knife |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 362], ["http://contemporary-home-computing.org/car-metaphors/google-as-swiss-army-knife-but-closed-but-not-any-more/", "Car Metaphors  » Blog Archive   » Google as Swiss Army Knife, but closed, but not any more", ["text", "\tCar Metaphors\t» Blog Archive\t» Google as Swiss Army Knife, but closed, but not any more\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tGoogle as Swiss Army Knife, but closed, but not any more\n2007-11-12 19:10\tby olia\tSome time ago Google’s product manager in Russia and Eastern Europe was writing about Google’s unlimited functions in the Google.ru blog and quoted Marissa Mayer’s words: Google is like a Swiss Army Knife.\nLooking for the source I was not precise enough with my search query and found many many pages where developers of applications, operating systems, frameworks are comparing their products with Offiziersmesser, meaning that they can do so many things so good without occupying a lot of space. I don’t know if Marissa\tMayer was the first one in IT business who came up with this comparison, but for sure only she, as Google’s product manager, has the right to bring this analogy to the ultimate level, saying “like the"], 3098], ["http://contemporary-home-computing.org/car-metaphors/2007/09/", "Car Metaphors   » 2007 » September", ["text", "\tCar Metaphors\t» 2007 » September\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for September, 2007\tBeams and Bulbs and Computer Scientists\n2007-09-14 13:08\tby olia\tPosted in light |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 325], ["http://contemporary-home-computing.org/car-metaphors/beams-and-bulbs-and-computer-scientists/", "Car Metaphors  » Blog Archive   » Beams and Bulbs and Computer Scientists", ["text", "\tCar Metaphors\t» Blog Archive\t» Beams and Bulbs and Computer Scientists\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tBeams and Bulbs and Computer Scientists\n2007-09-14 13:08\tby olia\tBeing trained as a journalist at Moscow State University I went through hundreds of hours analyzing the comparisons and figures of speech used in contemporary journalistic practice. Usually before the class we had to buy the newest issue of the newspaper “Soviet Sport.” It was a safe shot for our teachers, because sport observers dealing over and over again with monotonous body movements are really shameless in introducing metaphors and packing their texts with loads of them.\nBut i think computer scientist are much better than sport reporters.\nDavid Gelernter, a professor of computer science at Yale, describes something to replace the WWW. It will be called “Worldbeam.” To justify the name, stimulate our imagination and evoke positive feelings\the "], 3044], ["http://contemporary-home-computing.org/car-metaphors/2007/08/", "Car Metaphors   » 2007 » August", ["text", "\tCar Metaphors\t» 2007 » August\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for August, 2007\tA Bad Book\n2007-08-28 22:15\tby olia\tPosted in car,\tamateurs |\t2 Comments »\tDouglas Engelbart, the automobile and other analogies\n2007-08-26 15:37\tby olia\tPosted in car,\ttrain,\thistory,\tbicycle,\tviolin |\t1 Comment »\tThe Myth of Thinking Machines\n2007-08-25 08:17\tby olia\tPosted in history,\tbrain,\tAI |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 562], ["http://contemporary-home-computing.org/car-metaphors/a-bad-book/", "Car Metaphors  » Blog Archive   » A Bad Book", ["text", "\tCar Metaphors\t» Blog Archive\t» A Bad Book\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tA Bad Book\n2007-08-28 22:15\tby olia\tTrying to follow everything written on amateur culture, I’ve ordered a book by Andrew Keen The Cult of the Amateur.\nIt is a text, written by a person who hates amateurs and loves mainstream media. He uses the word amateur as a synonym for uneducated, lazy anonymous, internet addicted persons, monkeys with typewriters, who are mostly “sexual predators and pedophiles”. Mainstream media means just culture (in all fairness, he talks only about American culture, but again, for some reason, he sees American culture as a model).\nHe ridicules Kevin Kelly, Chris Anderson, Jimmy Wales, Tim O’Reilly, Sergey Brin and other web 2.0 magnates — however not for their exploitation of the amateur workforce, but to sully amateurs, deprecate their role and contrast them with real experts (Britannica consultants, Times’ repor"], 3536], ["http://contemporary-home-computing.org/car-metaphors/douglas-engelbart-the-automobile-and-other-analogies/", "Car Metaphors  » Blog Archive   » Douglas Engelbart, the automobile and other analogies", ["text", "\tCar Metaphors\t» Blog Archive\t» Douglas Engelbart, the automobile and other analogies\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tDouglas Engelbart, the automobile and other analogies\n2007-08-26 15:37\tby olia\tIn 2000 Stanford University Press published a book by Thierry Bardini — Bootstrapping: Douglas Engelbart, Coevolution, and the Origins of Personal Computing. I really regret that I read it only now, because it is a proper book for the fans of the Mother Of All Demos and admirers of Engelbart.\nBardini writes about the augmentation “crusade”, he documents in detail processes and arguments that preceded the birth of NLS and what happened after, the work and life in the Augmentation Research Center, ARC and its relations with other institutions, Engelbart’s correspondence with SRI and ARPA bosses and his colleagues, fights for mouse buttons, the Chord Keyset — though I knew the facts, I devoured the book like a thriller.\nBut"], 7029], ["http://contemporary-home-computing.org/car-metaphors/the-myth-of-thinking-machines/", "Car Metaphors  » Blog Archive   » The Myth of Thinking Machines", ["text", "\tCar Metaphors\t» Blog Archive\t» The Myth of Thinking Machines\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tThe Myth of Thinking Machines\n2007-08-25 08:17\tby olia\tIn 1961\tColumbia University Press published a bitter book by Mortimer Taube, librarian and pioneer of\tinformation retrieval systems development: Computers and Common Sense, the Myth of Thinking Machines.\tIt is supposed to be the first anti AI text, but as my cursory research shows it never received much attention — probably due to criticizing MIT, RAND, Harvard University and Rockefeller Foundation for spending millions on inventing chess playing machines.\nTaube claims that proper man-machine relations are augmentation and complementation, not simulation. At that time a distinction between simulation of the brain’s structure\tand simulation of its functions was already made by Turing and Minsky, but, Taube writes, there is no discussion or attempt to specify the fu"], 3437], ["http://contemporary-home-computing.org/car-metaphors/2007/07/", "Car Metaphors   » 2007 » July", ["text", "\tCar Metaphors\t» 2007 » July\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for July, 2007\tSlave in the Machine\n2007-07-25 13:14\tby olia\tPosted in history,\tanthropomorphic |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 316], ["http://contemporary-home-computing.org/car-metaphors/slave-in-the-machine/", "Car Metaphors  » Blog Archive   » Slave in the Machine", ["text", "\tCar Metaphors\t» Blog Archive\t» Slave in the Machine\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tSlave in the Machine\n2007-07-25 13:14\tby olia\tIn his book Deep Time of The Media on page 72, in chapter about early cryptography experiments, Siegfried Zielinski describes the way messages were delivered long long time ago:\n“As a rule, messengers were slaves, with their bodies to undertake the journey, their minds to understand the message, and mouths to repeat it accurately to the recipient. In our world of networked machines and programs, the problem of keeping communications secret has still not been solved. In anthropomorphic metaphor that refer to those ancient slaves’ bodies, we still refer to the header and body of a message.”\nThat is of course a big exaggeration. Нead and body metaphors did not come to email from our memory about slaves who were delivering their masters’ correspondence. Head and body of the message are not"], 2183], ["http://contemporary-home-computing.org/car-metaphors/2007/05/", "Car Metaphors   » 2007 » May", ["text", "\tCar Metaphors\t» 2007 » May\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for May, 2007\tThey May Call It Home\n2007-05-27 11:32\tby olia\tPosted in design,\thomepage,\tcaravan,\tgnomes,\tigoogle |\tNo Comments »\tBlogging Snowborders and Blogging Teenage Bicyclists\n2007-05-20 13:21\tby olia\tPosted in surfing,\tsnowboarding,\tbicycle |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 483], ["http://contemporary-home-computing.org/car-metaphors/igoogle-gnomes/", "Car Metaphors  » Blog Archive   » They May Call It Home", ["text", "\tCar Metaphors\t» Blog Archive\t» They May Call It Home\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tThey May Call It Home\n2007-05-27 11:32\tby olia\tIn an 1998 interview to W3J, Tim Berners-Lee formulated his attitude to private home pages:\nThey may call it a home page, but it’s more like the gnome in somebody’s front yard than the home itself.*\nPages of amateurs were always an easy target. Usability experts, content providers and especially professional designers never miss a chance to kick those who were writing “Welcome to my Home Page” on their page. For example in 2005, the Dutch interaction designer Hayo Wagenaar, with whom I shared a panel at Decade of Webdesign conference, flung a remark:\nThe question is, what do we think of amateurs getting involved in web design? It feels like getting stuck on the highway behind a caravan.\nObviously Tim Berners-Lee was irritated by the activities and aesthetics popping up in the medium "], 2438], ["http://contemporary-home-computing.org/car-metaphors/blogging-snowborders-and-blogging-teenage-bicyclists/", "Car Metaphors  » Blog Archive   » Blogging Snowborders and Blogging Teenage Bicyclists", ["text", "\tCar Metaphors\t» Blog Archive\t» Blogging Snowborders and Blogging Teenage Bicyclists\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tBlogging Snowborders and Blogging Teenage Bicyclists\n2007-05-20 13:21\tby olia\tTwo years ago the sarcastic author of Stoge.org wrote:\nBlogging is a form of vanity publishing: you can dress it up in fancy terms, call it “paradigm shifting” or a disruptive technology”, the truth is that blogs consist of senseless teenage waffle. Adopting the blogger lifestyle is the literary equivalent of attaching tinselly-sprinkles to the handelbars of your bicycle…*\nMy western friends say to me that tinselly-sprinkles should look like on the photo below, not necessary pink though. And I’d better not waste time interpreting it, the comparison is only offensive, without implication.\tFive years ago Henry Jenkins came up with a more positive analogy in the article “Blog It!” written for Technology Review:\nBloggers are "], 2538], ["http://contemporary-home-computing.org/car-metaphors/2007/03/", "Car Metaphors   » 2007 » March", ["text", "\tCar Metaphors\t» 2007 » March\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for March, 2007\tGood Morning!\n2007-03-20 22:58\tby olia\tPosted in car,\tindustrial revolution,\thistory,\tdesign |\t2 Comments »\tSmell my tires!\n2007-03-16 13:37\tby olia\tPosted in car,\tlamborghini |\t1 Comment »\tRuby on Rails\n2007-03-12 14:19\tby olia\tPosted in railways,\tprogramming |\t2 Comments »\tThe Rails of Inspiration\n2007-03-07 13:37\tby olia\tPosted in industrial revolution,\ttrain,\trailways |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 646], ["http://contemporary-home-computing.org/car-metaphors/good-morning/", "Car Metaphors  » Blog Archive   » Good Morning!", ["text", "\tCar Metaphors\t» Blog Archive\t» Good Morning!\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tGood Morning!\n2007-03-20 22:58\tby olia\tI’ve just finished to read Siegfried Zielinski’s\t“Deep Time of the Media“. It is an\tinspiring book. You’ll wish you were an inventor or a scientist after you read it, not an artist or blogger. In the end of the book the author gives you hope, because in his eyes media artists are very similar to medieval scientists.\tZielinski is a master of metaphors. In the nearest future I’d like to elaborate more on his vision of media artists as alchemists,\tand to debunk an anthropomorphic metaphor on page 73.\nBut for now I scanned an illustration from page 252: a not very known work of Fritz Kahn (1888-1968), one of the principal creators of the 20th century conceptual medical illustration. You probably know his Man as Industrial Palace visualisation of 1926.\nKahn’s comparative analysis of ear and car resu"], 3041], ["http://contemporary-home-computing.org/car-metaphors/smell-my-tires/", "Car Metaphors  » Blog Archive   » Smell my tires!", ["text", "\tCar Metaphors\t» Blog Archive\t» Smell my tires!\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tSmell my tires!\n2007-03-16 13:37\tby olia\tTo cheer up the Open Source Software crowd, an\tequity research analyst\tcame up with this slide (page 40) in his presentation on Open Source Software business models,\tstating that open source can be turbo expensive as well.\nI guess if I had to\tbring this thought to venture capital money-bags, I’d use the same example. If I’d have to convince housewives on the same topic, I’d put together Chanel vs. second hand Mark&Spencer (sold this week for 4 £ on eBay):\tIf my audience would be preschool kids, I’d avoid prices, but still would find an example of different implementation levels. Like this:\tBut the author of the Open Source Lamborghini\tDream did not talk in front of kids or housewives, or venture capitalists. His talked to open source developers and specialists.\nI would find it alarming, "], 3221], ["http://contemporary-home-computing.org/car-metaphors/ruby-on-rails/", "Car Metaphors  » Blog Archive   » Ruby on Rails", ["text", "\tCar Metaphors\t» Blog Archive\t» Ruby on Rails\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tRuby on Rails\n2007-03-12 14:19\tby olia\tI did not know what “ruby” means in English. And\tthough in Russian it is almost the same word for red gemstone — “rubin” — I thought that Ruby is a male name like Robby, Rudy or Eddie.\nThat’s why when I heard about Ruby on Rails my mind was always drawing the picture of a developer (Rudy, Robby, Eddie)\twho builds\tinfrastructure (Rails) for dynamic projects.\nYes, like this:\tThen I finally found out that Ruby is a programming language named after the gemstone; and that\tmy imaginary Rudy is David Hansson, who used\tRuby for a web application framework and named it Ruby on Rails. Since that name is quite long and clumsy it is usually shortened to Rails.\nThis post is actually about two guides on Rails.\tPrecisely about two covers of almost the same guide.\tThe Illustration on the “Agile Web Developm"], 3810], ["http://contemporary-home-computing.org/car-metaphors/the-rails-of-inspiration/", "Car Metaphors  » Blog Archive   » The Rails of Inspiration", ["text", "\tCar Metaphors\t» Blog Archive\t» The Rails of Inspiration\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tThe Rails of Inspiration\n2007-03-07 13:37\tby olia\tDragan, a blogger from the same server, pointed me to the article Changing Climates for Microsoft and Google, Desktops and Webs, with the intention that I should\twrite about the numerous weather and natural phenomena metaphors the author uses to describe the current\tand future state of the Operating Systems market. There are a lot indeed. There are so many that it is almost poetry.\tI’m not ready to go into that. But\tthere was something for me as well: an analogy to railways.\nFirst a brief primer on why it’s great to own an operating system. In short, it’s a lot like owning an industrial age railroad. Railways and trains are like operating systems and applications. Operating systems are the rails themselves. Applications are the trains which, of course, run on the rails. In "], 4323], ["http://contemporary-home-computing.org/car-metaphors/2007/02/", "Car Metaphors   » 2007 » February", ["text", "\tCar Metaphors\t» 2007 » February\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for February, 2007\tIrrational Ferrari\n2007-02-27 14:44\tby olia\tPosted in car,\tferrari |\tNo Comments »\t54 years of understanding DNA\n2007-02-21 22:50\tby olia\tPosted in nature |\t1 Comment »\tEngines and Processors\n2007-02-12 13:38\tby olia\tPosted in energy,\tcar |\t7 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 502], ["http://contemporary-home-computing.org/car-metaphors/irrational-ferrari/", "Car Metaphors  » Blog Archive   » Irrational Ferrari", ["text", "\tCar Metaphors\t» Blog Archive\t» Irrational Ferrari\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tIrrational Ferrari\n2007-02-27 14:44\tby olia\tSlashdot was featuring a story about Australians using BitTorrent for downloading episodes of a US TV series because they are broadcasted much later in Australia than in the US and there is no option for Australians to aquire them legally.\nOne commenter writes:\nJust because some people can’t get something, doesn’t make it right. I can’t afford a Ferrari, but nobody would justify me stealing it. Similarly, if a movie or show isn’t available in my market, it doesn’t justify piracy because the distributor for one reason or another didn’t make it available. Either wait [f]or it, or petition for it to be made or [sold].\nThat is an interesting case.\tWhen just a car is not an argument anymore, a very expensive car enters the discussion. What makes Anonymous Coward compare mass produced and mass "], 2767], ["http://contemporary-home-computing.org/car-metaphors/54-years-of-understanding-dna/", "Car Metaphors  » Blog Archive   » 54 years of understanding DNA", ["text", "\tCar Metaphors\t» Blog Archive\t» 54 years of understanding DNA\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\t54 years of understanding DNA\n2007-02-21 22:50\tby olia\tLarry Page is making analogies of DNA and operating systems.\nHe claims that the future of the search is in Artificial Intelligence. Difficult to disagree, and anyway it would be impossible to argue because Larry Page talks with a naughty smile on his lips, sort of ready to turn it into joke any moment.\tHe says that an AI future is very close because modern operating systems are bigger than our DNA,\tit should mean\tthat the problem of computing power, or as it is called in AI circles, the problem of scale, is not a problem any more.\t…if you look at your programming, your DNA\tis about 600 megabytes compressed, making it smaller than Linux or Windows or\tany modern operating system and includes booting up your brain.\nLarry Page is mixing up\tgenetic instructions fo"], 3362], ["http://contemporary-home-computing.org/car-metaphors/engines-and-processors/", "Car Metaphors  » Blog Archive   » Engines and Processors", ["text", "\tCar Metaphors\t» Blog Archive\t» Engines and Processors\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tEngines and Processors\n2007-02-12 13:38\tby olia\tSlashdot ran a discussion about an article that claimed Microsoft could use its power for good by switching on power save mode with an automatic update.\nTo support this idea, one commenter writes:\nImagine the laughs if a new car was brought out which required the engine to be on all the time — because if you turned it off you cannot unlock the doors.\nThis sounds funny indeed but has nothing to do with computers.\tA computer cannot work without electricity while it is very possible to open a door without electricity.\nComputers that require to be powered on all the time are usually doing something. They might be servers or occupied downloading\tmovies.\tsuggest yours and win an iPod\t54 years of understanding DNA →\tYou can follow any responses to this entry through the RSS"], 3916], ["http://contemporary-home-computing.org/car-metaphors/category/network/", "Car Metaphors   » network", ["text", "\tCar Metaphors\t» network\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “network” Category\tWho else is the cloud?\n2008-09-17 12:55\tby olia\tPosted in amateurs,\tnetwork,\tcloud,\ttime-sharing |\t3 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 341], ["http://contemporary-home-computing.org/car-metaphors/category/cloud/", "Car Metaphors   » cloud", ["text", "\tCar Metaphors\t» cloud\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “cloud” Category\tPower Utility vs. Information Utility\n2010-04-06 21:53\tby olia\tPosted in energy,\tcloud,\ttime-sharing |\tNo Comments »\tWho else is the cloud?\n2008-09-17 12:55\tby olia\tPosted in amateurs,\tnetwork,\tcloud,\ttime-sharing |\t3 Comments »\tCloud for 5 computers\n2008-08-05 18:32\tby olia\tPosted in history,\tcloud,\ttime-sharing |\t1 Comment »\tIn the phase of the aeroplane\n2008-08-04 20:10\tby olia\tPosted in airplane,\tcloud |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 686], ["http://contemporary-home-computing.org/car-metaphors/category/time-sharing/", "Car Metaphors   » time-sharing", ["text", "\tCar Metaphors\t» time-sharing\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “time-sharing” Category\tPower Utility vs. Information Utility\n2010-04-06 21:53\tby olia\tPosted in energy,\tcloud,\ttime-sharing |\tNo Comments »\tWho else is the cloud?\n2008-09-17 12:55\tby olia\tPosted in amateurs,\tnetwork,\tcloud,\ttime-sharing |\t3 Comments »\tCloud for 5 computers\n2008-08-05 18:32\tby olia\tPosted in history,\tcloud,\ttime-sharing |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 592], ["http://contemporary-home-computing.org/car-metaphors/category/igoogle/", "Car Metaphors   » igoogle", ["text", "\tCar Metaphors\t» igoogle\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “igoogle” Category\tGoogle as Swiss Army Knife, but closed, but not any more\n2007-11-12 19:10\tby olia\tPosted in GUI,\tigoogle,\tswiss_knife |\tNo Comments »\tThey May Call It Home\n2007-05-27 11:32\tby olia\tPosted in design,\thomepage,\tcaravan,\tgnomes,\tigoogle |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 492], ["http://contemporary-home-computing.org/car-metaphors/category/swiss_knife/", "Car Metaphors   » swiss_knife", ["text", "\tCar Metaphors\t» swiss_knife\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “swiss_knife” Category\tGoogle as Swiss Army Knife, but closed, but not any more\n2007-11-12 19:10\tby olia\tPosted in GUI,\tigoogle,\tswiss_knife |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 370], ["http://contemporary-home-computing.org/car-metaphors/category/book/", "Car Metaphors   » book", ["text", "\tCar Metaphors\t» book\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “book” Category\tBooks\n2011-11-14 18:09\tby olia\tPosted in paper,\tbook |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 290], ["http://contemporary-home-computing.org/car-metaphors/category/web_design/", "Car Metaphors   » web_design", ["text", "\tCar Metaphors\t» web_design\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “web_design” Category\tWeb Design and Plastic Surgery\n2010-10-24 13:13\tby olia\tPosted in web_design,\tplastic_surgery |\tNo Comments »\tPaperdigm: Paper Theater\n2010-03-17 11:01\tby olia\tPosted in web_design,\tpaper |\tNo Comments »\tThe Problem with Metaphors\n2010-03-02 13:39\tby olia\tPosted in web_design,\tdesktop,\tnavigation,\tcommunity |\tNo Comments »\tMistake #9\n2008-11-09 20:12\tby olia\tPosted in web_design |\t5 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 664], ["http://contemporary-home-computing.org/car-metaphors/category/history/", "Car Metaphors   » history", ["text", "\tCar Metaphors\t» history\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “history” Category\tOn behalf of the future\n2010-05-20 18:47\tby olia\tPosted in history,\tcyberspace |\tNo Comments »\tPaperdigm\n2010-03-03 13:22\tby olia\tPosted in history,\tpaper |\t1 Comment »\tCloud for 5 computers\n2008-08-05 18:32\tby olia\tPosted in history,\tcloud,\ttime-sharing |\t1 Comment »\tDouglas Engelbart, the automobile and other analogies\n2007-08-26 15:37\tby olia\tPosted in car,\ttrain,\thistory,\tbicycle,\tviolin |\t1 Comment »\tThe Myth of Thinking Machines\n2007-08-25 08:17\tby olia\tPosted in history,\tbrain,\tAI |\t1 Comment »\tSlave in the Machine\n2007-07-25 13:14\tby olia\tPosted in history,\tanthropomorphic |\tNo Comments »\tGood Morning!\n2007-03-20 22:58\tby olia\tPosted in car,\tindustrial revolution,\thistory,\tdesign |\t2 Comments »\tEntries (RSS)\tand Comments ("], 1012], ["http://contemporary-home-computing.org/car-metaphors/category/browser/", "Car Metaphors   » browser", ["text", "\tCar Metaphors\t» browser\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “browser” Category\tFull of Tabs\n2011-11-13 21:38\tby olia\tPosted in idiom,\tbrowser |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 306], ["http://contemporary-home-computing.org/car-metaphors/category/hyperlink/", "Car Metaphors   » hyperlink", ["text", "\tCar Metaphors\t» hyperlink\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “hyperlink” Category\tTo dress as a hyperlink\n2010-10-21 11:18\tby olia\tPosted in hyperlink,\tfashion,\tidiom |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 333], ["http://contemporary-home-computing.org/car-metaphors/category/fashion/", "Car Metaphors   » fashion", ["text", "\tCar Metaphors\t» fashion\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “fashion” Category\tTo dress as a hyperlink\n2010-10-21 11:18\tby olia\tPosted in hyperlink,\tfashion,\tidiom |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 329], ["http://contemporary-home-computing.org/car-metaphors/category/ai/", "Car Metaphors   » AI", ["text", "\tCar Metaphors\t» AI\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “AI” Category\tH-Metaphor\n2008-09-26 10:59\tby olia\tPosted in car,\tAI,\thorse |\tNo Comments »\tThe Myth of Thinking Machines\n2007-08-25 08:17\tby olia\tPosted in history,\tbrain,\tAI |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 405], ["http://contemporary-home-computing.org/car-metaphors/category/horse/", "Car Metaphors   » horse", ["text", "\tCar Metaphors\t» horse\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “horse” Category\tH-Metaphor\n2008-09-26 10:59\tby olia\tPosted in car,\tAI,\thorse |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 301], ["http://contemporary-home-computing.org/car-metaphors/category/train/", "Car Metaphors   » train", ["text", "\tCar Metaphors\t» train\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “train” Category\tDouglas Engelbart, the automobile and other analogies\n2007-08-26 15:37\tby olia\tPosted in car,\ttrain,\thistory,\tbicycle,\tviolin |\t1 Comment »\tThe Rails of Inspiration\n2007-03-07 13:37\tby olia\tPosted in industrial revolution,\ttrain,\trailways |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 491], ["http://contemporary-home-computing.org/car-metaphors/category/bicycle/", "Car Metaphors   » bicycle", ["text", "\tCar Metaphors\t» bicycle\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “bicycle” Category\tDouglas Engelbart, the automobile and other analogies\n2007-08-26 15:37\tby olia\tPosted in car,\ttrain,\thistory,\tbicycle,\tviolin |\t1 Comment »\tBlogging Snowborders and Blogging Teenage Bicyclists\n2007-05-20 13:21\tby olia\tPosted in surfing,\tsnowboarding,\tbicycle |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 517], ["http://contemporary-home-computing.org/car-metaphors/category/violin/", "Car Metaphors   » violin", ["text", "\tCar Metaphors\t» violin\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “violin” Category\tDouglas Engelbart, the automobile and other analogies\n2007-08-26 15:37\tby olia\tPosted in car,\ttrain,\thistory,\tbicycle,\tviolin |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 368], ["http://contemporary-home-computing.org/car-metaphors/category/industrial-revolution/", "Car Metaphors   » industrial revolution", ["text", "\tCar Metaphors\t» industrial revolution\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “industrial revolution” Category\tGood Morning!\n2007-03-20 22:58\tby olia\tPosted in car,\tindustrial revolution,\thistory,\tdesign |\t2 Comments »\tThe Rails of Inspiration\n2007-03-07 13:37\tby olia\tPosted in industrial revolution,\ttrain,\trailways |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 490], ["http://contemporary-home-computing.org/car-metaphors/category/design/", "Car Metaphors   » design", ["text", "\tCar Metaphors\t» design\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “design” Category\tThey May Call It Home\n2007-05-27 11:32\tby olia\tPosted in design,\thomepage,\tcaravan,\tgnomes,\tigoogle |\tNo Comments »\tGood Morning!\n2007-03-20 22:58\tby olia\tPosted in car,\tindustrial revolution,\thistory,\tdesign |\t2 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 465], ["http://contemporary-home-computing.org/car-metaphors/category/lamborghini/", "Car Metaphors   » lamborghini", ["text", "\tCar Metaphors\t» lamborghini\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “lamborghini” Category\tSmell my tires!\n2007-03-16 13:37\tby olia\tPosted in car,\tlamborghini |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 317], ["http://contemporary-home-computing.org/car-metaphors/category/ferrari/", "Car Metaphors   » ferrari", ["text", "\tCar Metaphors\t» ferrari\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “ferrari” Category\tIrrational Ferrari\n2007-02-27 14:44\tby olia\tPosted in car,\tferrari |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 310], ["http://contemporary-home-computing.org/car-metaphors/category/energy/", "Car Metaphors   » energy", ["text", "\tCar Metaphors\t» energy\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “energy” Category\tPower Utility vs. Information Utility\n2010-04-06 21:53\tby olia\tPosted in energy,\tcloud,\ttime-sharing |\tNo Comments »\tEngines and Processors\n2007-02-12 13:38\tby olia\tPosted in energy,\tcar |\t7 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 439], ["http://contemporary-home-computing.org/idioms/2007/03/", "Idioms   » 2007 » March", ["text", "\tIdioms\t» 2007 » March\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\tArchive for March, 2007\t“I need to underclock.” — Time for holidays!\n2007-03-20 23:01\tby drx\tPosted in work |\tNo Comments »\t“Let’s enlarge.” — Committing a small sin.\n2007-03-13 11:19\tby drx\tPosted in ethics |\tNo Comments »\t“It’s a norton thing.” — It’s a two-faced case.\n2007-03-07 11:03\tby drx\tPosted in ethics |\t2 Comments »\t“Read my blog!” — Get lost!\n2007-03-06 10:32\tby drx\tPosted in insults |\t3 Comments »\t“The Hand Moves the Mouse.” — You control your destiny.\n2007-03-04 22:54\tby drx\tPosted in destiny |\tNo Comments »\t“I defragged all the morning.” — I pretended to work.\t14:52\tby drx\tPosted in work |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 859], ["http://contemporary-home-computing.org/idioms/2007/02/", "Idioms   » 2007 » February", ["text", "\tIdioms\t» 2007 » February\tIdioms\nSuggestions on how to talk in the 21st century\tAbout\nCurrent\nArchives\tArchive for February, 2007\t“The blocks didn’t fall right” — Something did not work out as it should have\n2007-02-25 21:46\tby drx\tPosted in destiny |\t4 Comments »\t“That lady was bitmapped!” — This woman is stupid.\n2007-02-20 21:48\tby drx\tPosted in insults |\tNo Comments »\t“I gonna bang the bricks!” — I will draw money from an ATM\n2007-02-08 13:47\tby drx\tPosted in money |\t14 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 592], ["http://contemporary-home-computing.org/idioms/wp-login.php?action=lostpassword", "Idioms › Lost Password", ["text", "\tIdioms › Lost Password\tIdioms\nPlease enter your username and e-mail address. You will receive a new password via e-mail.\tUsername:\tE-mail:\tBack to Idioms\nLogin\t"], 183], ["http://contemporary-home-computing.org/still-there/dimensions-1.html", "GeoCities Dimensions (1)", ["text", "\tGeoCities Dimensions (1)\t➔\t"], 38], ["http://contemporary-home-computing.org/still-there/somewhere-1.html", "Rotterdam’s Internet Cafés (1)", ["text", "\tRotterdam’s Internet Cafés (1)\t➔\t"], 49], ["http://contemporary-home-computing.org/hyves/body-class-pimp/anonimnaaa.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 35], ["http://contemporary-home-computing.org/car-metaphors/category/painting/", "Car Metaphors   » painting", ["text", "\tCar Metaphors\t» painting\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “painting” Category\tA Mystery\n2011-11-30 22:07\tby olia\tPosted in painting |\t2 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 297], ["http://contemporary-home-computing.org/car-metaphors/category/app/", "Car Metaphors   » app", ["text", "\tCar Metaphors\t» app\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “app” Category\tCircle of UI\n2011-11-19 22:26\tby olia\tPosted in app,\tCLI,\tscrolling |\tNo Comments »\tMultimedia CD-ROM\n2011-08-08 09:07\tby olia\tPosted in cd-rom,\tapp |\t3 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 395], ["http://contemporary-home-computing.org/car-metaphors/category/cli/", "Car Metaphors   » CLI", ["text", "\tCar Metaphors\t» CLI\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “CLI” Category\tCircle of UI\n2011-11-19 22:26\tby olia\tPosted in app,\tCLI,\tscrolling |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 304], ["http://contemporary-home-computing.org/car-metaphors/category/scrolling/", "Car Metaphors   » scrolling", ["text", "\tCar Metaphors\t» scrolling\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “scrolling” Category\tCircle of UI\n2011-11-19 22:26\tby olia\tPosted in app,\tCLI,\tscrolling |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 316], ["http://contemporary-home-computing.org/car-metaphors/category/cd-rom/", "Car Metaphors   » cd-rom", ["text", "\tCar Metaphors\t» cd-rom\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “cd-rom” Category\tMultimedia CD-ROM\n2011-08-08 09:07\tby olia\tPosted in cd-rom,\tapp |\t3 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 305], ["http://contemporary-home-computing.org/car-metaphors/category/vacuum_cleaner/", "Car Metaphors   » vacuum_cleaner", ["text", "\tCar Metaphors\t» vacuum_cleaner\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “vacuum_cleaner” Category\tInternet and Vacuum Cleaner\n2010-11-28 00:16\tby olia\tPosted in vacuum_cleaner |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 334], ["http://contemporary-home-computing.org/car-metaphors/category/plastic_surgery/", "Car Metaphors   » plastic_surgery", ["text", "\tCar Metaphors\t» plastic_surgery\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “plastic_surgery” Category\tWeb Design and Plastic Surgery\n2010-10-24 13:13\tby olia\tPosted in web_design,\tplastic_surgery |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 353], ["http://contemporary-home-computing.org/car-metaphors/category/food/", "Car Metaphors   » food", ["text", "\tCar Metaphors\t» food\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “food” Category\tSlow Media Slow Food\n2010-06-28 19:08\tby olia\tPosted in food |\tNo Comments »\tDairy Products\n2010-05-29 16:07\tby olia\tPosted in food |\t1 Comment »\tThe most unappetizing analogy, open cola and free beer\n2008-09-19 10:19\tby olia\tPosted in OSS,\tfood |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 501], ["http://contemporary-home-computing.org/car-metaphors/category/cyberspace/", "Car Metaphors   » cyberspace", ["text", "\tCar Metaphors\t» cyberspace\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “cyberspace” Category\tOn behalf of the future\n2010-05-20 18:47\tby olia\tPosted in history,\tcyberspace |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 328], ["http://contemporary-home-computing.org/car-metaphors/category/materialization/", "Car Metaphors   » materialization", ["text", "\tCar Metaphors\t» materialization\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “materialization” Category\tIt just feels right\n2010-03-13 16:39\tby olia\tPosted in materialization |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 329], ["http://contemporary-home-computing.org/car-metaphors/category/desktop/", "Car Metaphors   » desktop", ["text", "\tCar Metaphors\t» desktop\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “desktop” Category\tThe Problem with Metaphors\n2010-03-02 13:39\tby olia\tPosted in web_design,\tdesktop,\tnavigation,\tcommunity |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 350], ["http://contemporary-home-computing.org/car-metaphors/category/navigation/", "Car Metaphors   » navigation", ["text", "\tCar Metaphors\t» navigation\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “navigation” Category\tThe Problem with Metaphors\n2010-03-02 13:39\tby olia\tPosted in web_design,\tdesktop,\tnavigation,\tcommunity |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 356], ["http://contemporary-home-computing.org/car-metaphors/category/community/", "Car Metaphors   » community", ["text", "\tCar Metaphors\t» community\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “community” Category\tThe Problem with Metaphors\n2010-03-02 13:39\tby olia\tPosted in web_design,\tdesktop,\tnavigation,\tcommunity |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 354], ["http://contemporary-home-computing.org/car-metaphors/category/surfing/", "Car Metaphors   » surfing", ["text", "\tCar Metaphors\t» surfing\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “surfing” Category\tSkate the Web\n2010-02-28 22:03\tby olia\tPosted in surfing,\tsnowboarding,\tskating |\tNo Comments »\tBlogging Snowborders and Blogging Teenage Bicyclists\n2007-05-20 13:21\tby olia\tPosted in surfing,\tsnowboarding,\tbicycle |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 471], ["http://contemporary-home-computing.org/car-metaphors/category/snowboarding/", "Car Metaphors   » snowboarding", ["text", "\tCar Metaphors\t» snowboarding\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “snowboarding” Category\tSkate the Web\n2010-02-28 22:03\tby olia\tPosted in surfing,\tsnowboarding,\tskating |\tNo Comments »\tBlogging Snowborders and Blogging Teenage Bicyclists\n2007-05-20 13:21\tby olia\tPosted in surfing,\tsnowboarding,\tbicycle |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 481], ["http://contemporary-home-computing.org/car-metaphors/category/skating/", "Car Metaphors   » skating", ["text", "\tCar Metaphors\t» skating\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “skating” Category\tSkate the Web\n2010-02-28 22:03\tby olia\tPosted in surfing,\tsnowboarding,\tskating |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 324], ["http://contemporary-home-computing.org/car-metaphors/category/religion/", "Car Metaphors   » religion", ["text", "\tCar Metaphors\t» religion\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “religion” Category\tApproved by the Pope\n2009-04-08 08:00\tby olia\tPosted in religion |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 309], ["http://contemporary-home-computing.org/car-metaphors/category/hackers/", "Car Metaphors   » hackers", ["text", "\tCar Metaphors\t» hackers\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “hackers” Category\tHackers and …\n2009-03-08 13:08\tby olia\tPosted in hackers,\tyugoslavia |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 312], ["http://contemporary-home-computing.org/car-metaphors/category/yugoslavia/", "Car Metaphors   » yugoslavia", ["text", "\tCar Metaphors\t» yugoslavia\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “yugoslavia” Category\tHackers and …\n2009-03-08 13:08\tby olia\tPosted in hackers,\tyugoslavia |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 318], ["http://contemporary-home-computing.org/car-metaphors/category/oss/", "Car Metaphors   » OSS", ["text", "\tCar Metaphors\t» OSS\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “OSS” Category\tThe most unappetizing analogy, open cola and free beer\n2008-09-19 10:19\tby olia\tPosted in OSS,\tfood |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 333], ["http://contemporary-home-computing.org/car-metaphors/category/airplane/", "Car Metaphors   » airplane", ["text", "\tCar Metaphors\t» airplane\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “airplane” Category\tIn the phase of the aeroplane\n2008-08-04 20:10\tby olia\tPosted in airplane,\tcloud |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 326], ["http://contemporary-home-computing.org/car-metaphors/category/light/", "Car Metaphors   » light", ["text", "\tCar Metaphors\t» light\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “light” Category\tBeams and Bulbs and Computer Scientists\n2007-09-14 13:08\tby olia\tPosted in light |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 319], ["http://contemporary-home-computing.org/car-metaphors/category/brain/", "Car Metaphors   » brain", ["text", "\tCar Metaphors\t» brain\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “brain” Category\tThe Myth of Thinking Machines\n2007-08-25 08:17\tby olia\tPosted in history,\tbrain,\tAI |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 322], ["http://contemporary-home-computing.org/car-metaphors/category/anthropomorphic/", "Car Metaphors   » anthropomorphic", ["text", "\tCar Metaphors\t» anthropomorphic\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “anthropomorphic” Category\tSlave in the Machine\n2007-07-25 13:14\tby olia\tPosted in history,\tanthropomorphic |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 340], ["http://contemporary-home-computing.org/car-metaphors/category/homepage/", "Car Metaphors   » homepage", ["text", "\tCar Metaphors\t» homepage\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “homepage” Category\tThey May Call It Home\n2007-05-27 11:32\tby olia\tPosted in design,\thomepage,\tcaravan,\tgnomes,\tigoogle |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 348], ["http://contemporary-home-computing.org/car-metaphors/category/caravan/", "Car Metaphors   » caravan", ["text", "\tCar Metaphors\t» caravan\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “caravan” Category\tThey May Call It Home\n2007-05-27 11:32\tby olia\tPosted in design,\thomepage,\tcaravan,\tgnomes,\tigoogle |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 346], ["http://contemporary-home-computing.org/car-metaphors/category/gnomes/", "Car Metaphors   » gnomes", ["text", "\tCar Metaphors\t» gnomes\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “gnomes” Category\tThey May Call It Home\n2007-05-27 11:32\tby olia\tPosted in design,\thomepage,\tcaravan,\tgnomes,\tigoogle |\tNo Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 344], ["http://contemporary-home-computing.org/car-metaphors/category/railways/", "Car Metaphors   » railways", ["text", "\tCar Metaphors\t» railways\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “railways” Category\tRuby on Rails\n2007-03-12 14:19\tby olia\tPosted in railways,\tprogramming |\t2 Comments »\tThe Rails of Inspiration\n2007-03-07 13:37\tby olia\tPosted in industrial revolution,\ttrain,\trailways |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 440], ["http://contemporary-home-computing.org/car-metaphors/category/programming/", "Car Metaphors   » programming", ["text", "\tCar Metaphors\t» programming\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “programming” Category\tRuby on Rails\n2007-03-12 14:19\tby olia\tPosted in railways,\tprogramming |\t2 Comments »\tEntries (RSS)\tand Comments (RSS).\t"], 321], ["http://contemporary-home-computing.org/car-metaphors/category/nature/", "Car Metaphors   » nature", ["text", "\tCar Metaphors\t» nature\tCar Metaphors\nWatching Analogies in the World of Computers\tAbout\nCurrent\nArchives\tArchive for the “nature” Category\t54 years of understanding DNA\n2007-02-21 22:50\tby olia\tPosted in nature |\t1 Comment »\tEntries (RSS)\tand Comments (RSS).\t"], 310], ["http://contemporary-home-computing.org/idioms/wp-login.php", "Idioms › Login", ["text", "\tIdioms › Login\tIdioms\tUsername:\tPassword:\tRemember me\tBack to Idioms\nLost your password?\t"], 116], ["http://contemporary-home-computing.org/still-there/dimensions-2.html", "GeoCities Dimensions (2)", ["text", "\tGeoCities Dimensions (2)\t➔\t"], 38], ["http://contemporary-home-computing.org/still-there/somewhere-2.html", "Rotterdam’s Internet Cafés (2)", ["text", "\tRotterdam’s Internet Cafés (2)\t➔\t"], 49], ["http://contemporary-home-computing.org/hyves/body-class-pimp/tamsamane123.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 35], ["http://contemporary-home-computing.org/still-there/dimensions-3.html", "GeoCities Dimensions (3)", ["text", "\tGeoCities Dimensions (3)\t➔\t"], 38], ["http://contemporary-home-computing.org/still-there/somewhere-3.html", "Rotterdam’s Internet Cafés (3)", ["text", "\tRotterdam’s Internet Cafés (3)\t➔\t"], 49], ["http://contemporary-home-computing.org/hyves/body-class-pimp/damlos.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/still-there/dimensions-4.html", "GeoCities Dimensions (4)", ["text", "\tGeoCities Dimensions (4)\t➔\t"], 38], ["http://contemporary-home-computing.org/still-there/somewhere-4.html", "Rotterdam’s Internet Cafés (4)", ["text", "\tRotterdam’s Internet Cafés (4)\t➔\t"], 49], ["http://contemporary-home-computing.org/hyves/body-class-pimp/gekregen2012.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/still-there/dimensions-5.html", "GeoCities Dimensions (5)", ["text", "\tGeoCities Dimensions (5)\t➔\t"], 38], ["http://contemporary-home-computing.org/still-there/somewhere-5.html", "Rotterdam’s Internet Cafés (5)", ["text", "\tRotterdam’s Internet Cafés (5)\t➔\t"], 49], ["http://contemporary-home-computing.org/hyves/body-class-pimp/common-sense.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/still-there/somewhere-6.html", "Rotterdam’s Internet Cafés (6)", ["text", "\tRotterdam’s Internet Cafés (6)\t➔\t"], 49], ["http://contemporary-home-computing.org/hyves/body-class-pimp/winter.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 35], ["http://contemporary-home-computing.org/still-there/somewhere-7.html", "Rotterdam’s Internet Cafés (7)", ["text", "\tRotterdam’s Internet Cafés (7)\t➔\t"], 49], ["http://contemporary-home-computing.org/hyves/body-class-pimp/brachim-westboy.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/still-there/somewhere-8.html", "Rotterdam’s Internet Cafés (8)", ["text", "\tRotterdam’s Internet Cafés (8)\t➔\t"], 49], ["http://contemporary-home-computing.org/hyves/body-class-pimp/yiglo5314.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 35], ["http://contemporary-home-computing.org/still-there/somewhere-9.html", "Rotterdam’s Internet Cafés (9)", ["text", "\tRotterdam’s Internet Cafés (9)\t➔\t"], 49], ["http://contemporary-home-computing.org/hyves/body-class-pimp/lisamariiej402.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/still-there/somewhere-10.html", "Rotterdam’s Internet Cafés (10)", ["text", "\tRotterdam’s Internet Cafés (10)\t➔\t"], 50], ["http://contemporary-home-computing.org/hyves/body-class-pimp/roffatje010.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 35], ["http://contemporary-home-computing.org/still-there/somewhere-11.html", "Rotterdam’s Internet Cafés (11)", ["text", "\tRotterdam’s Internet Cafés (11)\t➔\t"], 50], ["http://contemporary-home-computing.org/hyves/body-class-pimp/barbiieetorres.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 35], ["http://contemporary-home-computing.org/still-there/somewhere-12.html", "Rotterdam’s Internet Cafés (12)", ["text", "\tRotterdam’s Internet Cafés (12)\t➔\t"], 50], ["http://contemporary-home-computing.org/hyves/body-class-pimp/dancehal.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/still-there/somewhere-13.html", "Rotterdam’s Internet Cafés (13)", ["text", "\tRotterdam’s Internet Cafés (13)\t➔\t"], 50], ["http://contemporary-home-computing.org/hyves/body-class-pimp/nuuur38.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 35], ["http://contemporary-home-computing.org/still-there/somewhere-14.html", "Rotterdam’s Internet Cafés (14)", ["text", "\tRotterdam’s Internet Cafés (14)\t➔\t"], 50], ["http://contemporary-home-computing.org/hyves/body-class-pimp/naoualtje89.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/still-there/somewhere-15.html", "Rotterdam’s Internet Cafés (15)", ["text", "\tRotterdam’s Internet Cafés (15)\t➔\t"], 50], ["http://contemporary-home-computing.org/hyves/body-class-pimp/henessy.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/still-there/somewhere-16.html", "Rotterdam’s Internet Cafés (16)", ["text", "\tRotterdam’s Internet Cafés (16)\t➔\t"], 50], ["http://contemporary-home-computing.org/hyves/body-class-pimp/amazich-boy.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 35], ["http://contemporary-home-computing.org/hyves/body-class-pimp/goonchiba.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/hyves/body-class-pimp/moker204.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/hyves/body-class-pimp/eyecatcher.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 35], ["http://contemporary-home-computing.org/hyves/body-class-pimp/891473303.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 35], ["http://contemporary-home-computing.org/hyves/body-class-pimp/westcoast21.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/hyves/body-class-pimp/hamzatje010.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/hyves/body-class-pimp/rr-yassine.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36], ["http://contemporary-home-computing.org/hyves/body-class-pimp/halim71.html", "Hyves: Body Class Pimp", ["text", "\tHyves: Body Class Pimp\t➔\t"], 36]]